{"nama":"Agile Development","response_code":"00","response_msg":"Berhasil mendapatkan materi kelas","materi_kelas":{"id":6,"uuid":"91815f1d-dd63-4b97-bdcf-c3542d89e8fc","kategori_kelas_id":8,"versi":"1.0.0","created_by":7896,"updated_by":7896,"created_at":"2020-12-05 13:41:14","updated_at":null},"section":[{"id":37,"uuid":"4c789004-62fe-4718-9855-969f5e267876","materi_id":6,"nama":"Day 1","permalink":"day-1","urutan":1,"created_by":7896,"updated_by":7896,"created_at":"2020-12-05 13:41:55","updated_at":null,"posting":[{"id":135,"uuid":"f2ca81c6-f471-499a-ade9-96a10dcce78e","author_user_id":7896,"materi_section_id":37,"judul":"Day 1: Pengenalan Manajemen Proyek","permalink":"day-1-pengenalan-manajemen-proyek","konten":"<p><!-- wp:image {\"align\":\"center\",\"id\":3353,\"sizeSlug\":\"large\"} --><\/p>\r\n<div class=\"wp-block-image\">\r\n<figure class=\"aligncenter size-large\"><img class=\"wp-image-3353\" src=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/triangle-3125882_1920-1-1024x614.jpg\" alt=\"\" \/><\/figure>\r\n<\/div>\r\n<p><!-- \/wp:image --> <!-- wp:paragraph --><\/p>\r\n<p>Kita pasti sudah tidak asing dengan istilah proyek. Proyek pembangunan, proyek telekomunikasi, proyek sosial budaya, proyek sistem informasi, dan banyak lainnya. Ada baiknya kita menyepakati kata ini secara definitif dan kontekstual. Proyek adalah suatu kegiatan untuk mencapai tujuan spesifik dalam kurun waktu tertentu. Artinya proyek memiliki waktu mulai dan selesai yang jelas. Dua karakter lain yang melekat pada proyek adalah mengenai sponsorship dan ketidakpastian. Sponsorship, artinya ada pihak tertentu yang memberikan dukungan terhadap proyek secara finansial atau materil. Proyek juga melibatkan ketidakpastian dalam keberjalanannya.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Karena menghadapi ketidakpastian, proyek perlu dijalankan dengan perhitungan, pengelolaan, dan eksekusi yang baik. Maka diperlukan manajemen proyek. Manajemen proyek ialah kumpulan pengetahuan yang dapat diterapkan dalam menjalankan suatu kegiatan (proyek), supaya kegiatan tersebut dapat mencapai tujuan secara efektif dengan memanfaatkan sumber daya yang efisien. Orang yang berperan untuk menjalankan konsep manajemen proyek disebut dengan manajer proyek.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Manajer proyek dituntut untuk memiliki pengetahuan yang luas sekaligus cukup dalam mengenai proyek. Ada setidaknya sepuluh area pengetahuan (<em>knowledge area<\/em>) yang perlu dikuasai oleh manajer proyek. Sepuluh area pengetahuan tersebut dikelompokkan menjadi tiga kategori. Perhatikan tabel berikut.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:image {\"align\":\"center\",\"id\":2559,\"sizeSlug\":\"large\"} --><\/p>\r\n<div class=\"wp-block-image\">\r\n<figure class=\"aligncenter size-large\"><img class=\"wp-image-2559\" src=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/tabel-knowledge-area.jpg\" alt=\"\" \/><\/figure>\r\n<\/div>\r\n<p><!-- \/wp:image --> <!-- wp:paragraph --><\/p>\r\n<p>Kategori pengetahuan dibagi menjadi pengetahuan inti (core knowledge), pengetahuan pendukung (support knowledge), dan pengetahuan integrasi (integration knowledge). Pengetahuan inti yang harus dikuasai manajer proyek adalah lingkup (scope), waktu, biaya, dan kualitas. Area pengetahuan pendukung antara lain: Sumber daya manusia, komunikasi, risiko, pengadaan, dan pemangku kepentiangan. Sedangkan pengetahuan dalam kategori integrasi, adalah pengatahuan spesifik mengenai proyek yang sedang dijalankan. Untuk menjelaskan setiap area pengetahuan secara detil membutuhkan setidaknya satu bab tersendiri. Karena keterbatasan waktu, dalam artikel ini tidak akan menjabarkan keseluruhan area pengetahuan tersebut.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Lingkup proyek merupakan pengetahuan yang mencakup tujuan proyek, parameter ketercapaian, serta batasan-batasannya. Dalam pengembangan proyek perangkat lunak, lingkup biasanya selaras dengan lis fitur yang dikembangkan. Waktu proyek merupakan pengetahuan tentang kapan proyek dimulai, kapan proyek selesai, dan bagaimana hari demi hari berlalu antara keduanya. Biaya proyek adalah pengetahuan tentang aliran uang masuk dan keluar untuk keberjalanan proyek. Sedangkan kualitas adalah ukuran kesesuaian antara espektasi customer dengan realisasi yang dihasilkan proyek. Empat area ini dikategorikan sebagai inti (<em>core<\/em>) karena menjadi acuan bagi keberhasilan proyek pada umumnya. Perhatikan ilustrasi berikut!<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:image {\"id\":2558,\"sizeSlug\":\"large\"} --><\/p>\r\n<figure class=\"wp-block-image size-large\"><img class=\"wp-image-2558\" src=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/segitiga-parameter-manpro.png\" alt=\"\" \/><\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:paragraph --><\/p>\r\n<p>Selanjutnya, kita akan mengenal area pengetahuan pendukung (<em>support<\/em>), di antaranya: Sumber daya manusia, komunikasi, risiko, pengadaan, dan pemanku kepentingan. Sumber daya manusia yang dimaksud adalah pengelolaan orang-orang dalam tim. Untuk dapat menjalankan proyek dengan sinergis, anggota tim perlu berkomunikasi dengan baik. Komunikasi yang baik (efektif dan efisien) perlu dikelola sedemikian rupa, sehingga dapat menunjang keberjalanan proyek. Namun karena proyek, seperti yang sudah kita sepakati tadi, merupakan kegiatan yang melibatkan ketidakpastian, maka akan selalu ada risiko yang dihadapi. Risiko adalah potensi negatif dan positif yang dapat muncul sewaktu-waktu dalam keberjalanan proyek. Risiko harus dikelola sebaik mungkin supaya meminimalisir kerugian dan mengubahnya menjadi keuntungan bagi proyek. Selanjutnya ada pengadaan (<em>procurement<\/em>) merupakan pengelolaan terkait barang, jasa, infrastruktur, dan materil lain yang dibutuhkan untuk menunjang keberjalanan proyek. Contoh dalam proyek pengembangan perangkat lunak adalah seperti pengadaan unit server untuk meluncurkan (<em>deploy<\/em>) aplikasi. Kemudian perlu pengetahuan dan pengelolaan <em>stakeholder <\/em>(pemangku kepentingan). Pemangku kepentingan adalah semua orang yang terlibat dalam proyek, baik secara langsung maupun tidak langsung. Pemangku kepentingan contohnya adalah pihak sponsor, klien, <em>end user<\/em> (pengguna), dan masih banyak lainnya.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Area pengetahuan dengan kategori ketiga (integrasi) adalah pengetahuan spesifik mengenai proyek. Misalnya dalam proyek pembangunan jalan tol, maka dibutuhkan banyak keilmuan dari rumpun teknik sipil, arsitektur, ilmu tanah, legalitas, dan lain-lain. Contoh lain dalam proyek IT, dibutuhkan keulmuan tentang <em>programming<\/em>, dokumentasi, jaringan, UI\/UX, dan banyak lainnya.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Bagi sebuah tim proyek, menguasai dan menerapkan manajemen proyek sangat penting bagi keberhasilan proyek. Setidaknya ada tiga hal yang dapat menjelaskan pentingnya manajemen proyek. Pertama, manajemen proyek adalah kakas yang digunakan pelaksana proyek untuk mencapai tujuan sesuai dengan lingkup yang diinginkan. Kedua, manajemen proyek membantu mengoptimalkan biaya dan waktu yang digunakan selama proyek berlangung. Banyak proyek gagal karena kehabisan dana sebelum tujuan proyek tercapai. Ada juga proyek lain yang tidak kunjung selesai karena melewati batas waktu yang sudah ditentukan. Ketiga, manajemen proyek dapat dijadikan alat untuk mengontrol kualitas dari produk yang dihasilkan dalam proyek. Jadi proyek tidak asal selesai tepat waktu dan dana, tapi juga sesuai espektasi dari pemilik proyek.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Pentingnya manajemen proyek bagi perusahaan atau pemilik proyek, membuat mereka membutuhkan manajer-manaje proyek yang handal. Manajer proyek yang handal biasanya lahir dari proses yang panjang, tidak bisa sekadar belajar kemudian langsung bisa menerapkan pengetahuannya dalam proyek. Proyek tertentu bahkan hanya menerima manajer proyek yang memiliki pengalaman 5-10 tahun, ini tentu bukan waktu yang sebentar. Karena kebutuhan yang vital, rata-rata gaji dari profesi ini juga sangat menjanjikan. Meurut situs id.neuvoo.com, rata-rata gaji manajer proyek di Indonesia adalah 10 juta rupiah per bulan. <em>Sallary rate <\/em>yang tinggi ini juga menuntut pengetahuan, profesionalitas, dan kemampuan yang tinggi.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Kelas ini berkaitan erat dengan manajemen proyek dalam konteks IT (<em>Information Technology<\/em>). Maka kita perlu memahami karakter proyek IT modern. Berbeda dengan proyek IT pada masa sebelumnya, proyek IT pada era modern ini cenderung memiliki kompleksitas yang tinggi. Kompleksitas yang tinggi membuat proyek tidak mudah diprediksi secara waktu dan dana. Ini berbeda dengan proyek pembangunan infrastruktur yang cenderung memiliki dasar dan prinsip yang sama. Bahkan dalam dunia IT, ada yang menyebutkan bahwa setiap 7 tahun teknologi akan terus berganti. Belum lagi bicara tentang desain UI\/UI (<em>User Interface, User Experience<\/em>) yang sangat cepat berkembang sebagai sebuah tren. Maka metodologi manajemen proyek IT dituntut untuk dapat menyesuaikan perkembangan yang ada.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Apa itu metodologi manajemen proyek? Kita akan bahas pada sesi selanjutnya.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Terimakasih.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:file {\"id\":3752,\"href\":\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/Agile-Dev-1_Pengenalan-Manajemen-Proyek.pptx\"} --><\/p>\r\n<div class=\"wp-block-file\"><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/Agile-Dev-1_Pengenalan-Manajemen-Proyek.pptx\">Agile Dev 1_Pengenalan Manajemen Proyek<\/a><a class=\"wp-block-file__button\" href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/Agile-Dev-1_Pengenalan-Manajemen-Proyek.pptx\" download=\"\">Unduh<\/a><\/div>\r\n<p><!-- \/wp:file --> <!-- wp:file {\"id\":9048,\"href\":\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Tugas-Day-1-Agustus-1.docx\"} --><\/p>\r\n<div class=\"wp-block-file\"><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Tugas-Day-1-Agustus-1.docx\">Tugas-Day-1<\/a><a class=\"wp-block-file__button\" href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Tugas-Day-1-Agustus-1.docx\" download=\"\">Unduh<\/a><\/div>\r\n<p><!-- \/wp:file --> <!-- wp:paragraph --><\/p>\r\n<p>===<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Referensi:<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Kathy Schwalbe, <em>Information Technology Project Manajement, <\/em>7e edition.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p><em>Gaji Project Manager, <\/em>tersedia pada: <a href=\"https:\/\/id.neuvoo.com\/gaji\/?job=Project+Manager\">https:\/\/id.neuvoo.com\/gaji\/?job=Project+Manager<\/a><\/p>\r\n<p><!-- \/wp:paragraph --><\/p>","waktu_publish":"2021-10-25 08:00:00","status_publish":"publish","urutan":1,"created_by":7896,"updated_by":7896,"created_at":"2020-12-05 13:55:32","updated_at":"2021-10-24 11:20:43","waktu_publish_formatted":" Senin, 25 Oktober 2021. 08:00:00 WIB."}]},{"id":66,"uuid":"e3741481-9815-4579-94f4-ff7675964776","materi_id":6,"nama":"Day 2","permalink":"day-2","urutan":2,"created_by":7896,"updated_by":7896,"created_at":"2020-12-06 17:31:54","updated_at":null,"posting":[{"id":208,"uuid":"104e4088-1569-4a19-a564-c09c5666e5c8","author_user_id":7896,"materi_section_id":66,"judul":"Day 2: Waterfall vs Agile Methodology","permalink":"day-2-waterfall-vs-agile-methodology","konten":"<p><!-- wp:paragraph {\"align\":\"left\"} --><\/p>\r\n<p class=\"has-text-align-left\">Sebelumnya kita telah membahas pengenalan tentang proyek dan manajemen proyek. Dalam menerapkan manajemen proyek diperlukan sebuah metodologi atau pendekatan. Metodologi atau pendekatan merupakan suatu ilmu mengenai metode. Dua contoh metodologi yang sudah sangat besar dan dipakai oleh banyak orang di seluruh dunia: Waterfall dan Agile. Mari fokus terlebih dahulu pada pendekatan Waterfall.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Apa yang dimaksud dengan pendekatan Waterfall?<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Waterfall merupakan salah satu pendekatan manajemen proyek yang terbagi menjadi beberapa fase sekuensial. Sekuensial artinya bertahap, satu demi satu. Pendekatan ini diambil dari istilah &lsquo;air terjun&rsquo; karena alur fase satu dengan lainnya berurutan seperti air terjun. Batas antara satu fase dengan fase lainnya disebut dengan <em>gate. <\/em>Pada ilustrasi berikut ini, diperlihatkan bagaimana fase dan gate saling terhubung. Fase dua dapat dilakukan setelah fase satu selesai, kemudian perpindahan fase dilakukan dengan melewati <em>gate. <\/em>Setelah melewati <em>gate <\/em>antara fase satu dan dua, proses pelaksanaan proyek pada dasarnya tidak bisa mengulangi pengerjaan fase satu.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:image {\"id\":2803,\"sizeSlug\":\"large\"} --><\/p>\r\n<figure class=\"wp-block-image size-large\"><img class=\"wp-image-2803\" src=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/waterfall.png\" alt=\"\" \/><\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:paragraph --><\/p>\r\n<p>Pendekatan ini diawali dengan menjabarkan kebutuhan atau <em>requirements <\/em>secara detail. Kebutuhan merupakan ekspektasi dan keinginan dari pemilik proyek mengenai tujuan dan hasil yang ingin dicapai oleh proyek. Setelah kebutuhan dijabarkan di awal, pendekatan ini akan mengimplementasikan <em>change control <\/em>sekali setelah <em>requirement <\/em>disetujui. Ini dilakukan untuk mendapatkan kontrol dan prediksi atas proyek dari sisi biaya dan jadwal. Mari kita ingat kembali skema <em>Iron Triangle <\/em>pada materi sebelumnya. Ilustrasi dari pelaksanaan Waterfall adalah untuk &lsquo;mengunci&rsquo; sebuah aspek dari <em>Iron Triangle: <\/em>Lingkup. Jadi, proyek yang menerapkan pendekatan ini, berusaha memprediksi waktu dan biaya dari proyek dengan mempertimbangkan lingkup yang <em>fixed<\/em> di awal.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:image {\"id\":3912,\"sizeSlug\":\"large\"} --><\/p>\r\n<p><!-- \/wp:image --> <!-- wp:paragraph --><\/p>\r\n<p>Pendekatan ini setidaknya memiliki tiga fase, pengembangannya dalam berbagai bidang proyek dapat menjadi 5 hingga 6 fase. Tiga fase tersebut adalah: mendefinisikan <em>requirements, <\/em>mendesain dan membangun solusi, kemudian mengetes dan mengimplementasikan solusi. Solusi yang dimaksud adalah keluaran dari proyek. Satu fase dengan fase lainnya dibatasi oleh <em>gate <\/em>(terjemah: gerbang). Setelah melewati <em>gate, <\/em>pada dasarnya proses pengerjaan proyek tidak bisa mengulangi fase sebelumnya. Pada praktiknya, beberapa proses dibuat supaya dapat berulang meskipun sangat terbatas. Perhatikan skema berikut ini.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:image {\"id\":2805,\"sizeSlug\":\"large\"} --><\/p>\r\n<figure class=\"wp-block-image size-large\"><img class=\"wp-image-2805\" src=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/waterfall-2-1024x557.png\" alt=\"\" \/><\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:paragraph --><\/p>\r\n<p>Pendekatan ini populer pada tahun 1970-1990-an. Alur yang sederhana dan disiplin membuat orang-orang menyukai pendekatan ini. Sayangnya pendekatan ini lebih cocok digunakan untuk melaksanakan proyek dalam kategori keilmuan yang cenderung statis. Misalnya proyek pembangunan infrsatruktur jalan, dimana keilmuan teknik sipil dan material sangat dominan. Dua keilmuan tersebut cenderung statis dan prediktif. Sedangkan dalam dunia sistem informasi, kompleksitas dan teknologi pengembangannya sangat cepat berubah dan berkembang. Karenanya, muncul beberapa kelemahan dari pendekatan ini dalam pelaksanaan proyek IT (<em>Information Technology<\/em>).<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Tiga masalah utama pendekatan ini dalam IT adalah:<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li>Bug pada program atau ketidaksesuaian espektasi pemilik proyek akan diketahui pada fase akhir, setelah proses desain dan implementasi yang memakan waktu dan biaya,<\/li>\r\n<li>Masukan dari <em>end user <\/em>dari produk sangat terbatas dan diberikan di akhir proses pelaksanaan proyek,<\/li>\r\n<li>Tidak banyak <em>change request <\/em>yang diajukan pemilik proyek dan <em>end user,<\/em> hal ini akan berdampak pada penurunan kualitas produk.<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Karena kelemahan-kelemahan tersebut, orang-orang mulai memodifikasi pendekatan ini. Modifikasi banyak dilakukan dalam konteks pengulangan beberapa fase dan prosedur pelaksanaanya. Pada tahun 1980-1990-an, penggunaan Waterfall murni sudah jarang sekali ditemukan. Seiring berjalan waktu, muncul pendekatan lain yang lain: pendekatan iteratif. Pendekatan ini mencoba menjawab masalah yang tidak bisa ditangani oleh Waterfall. Ini juga menjadi cikal bakal kelahiran metodologi Agile dan turunannya.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:file {\"id\":3919,\"href\":\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/Presentasi-Metodologi-Waterfall-1.pptx\"} --><\/p>\r\n<div class=\"wp-block-file\"><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/Presentasi-Metodologi-Waterfall-1.pptx\">Presentasi - Metodologi Waterfall<\/a><a class=\"wp-block-file__button\" href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/Presentasi-Metodologi-Waterfall-1.pptx\" download=\"\">Unduh<\/a><\/div>\r\n<p><!-- \/wp:file --><\/p>\r\n<p>&nbsp;<\/p>\r\n<p><!-- wp:image {\"align\":\"center\",\"id\":2825,\"sizeSlug\":\"large\"} --><\/p>\r\n<div class=\"wp-block-image\">\r\n<figure class=\"aligncenter size-large\"><img class=\"wp-image-2825\" src=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/agile.jpg\" alt=\"\" \/><\/figure>\r\n<\/div>\r\n<p><!-- \/wp:image --> <!-- wp:paragraph --><\/p>\r\n<p>Selanjutnya, kita akan belajar bersama mengenai pendekatan Agile. Pendekatan ini mulai lahir pada tahun 1990-an. Pada era tersebut, muncul berbagai kerangka kerja seperti Extreme Programming, Scrum, Crystal Clear, Dynamic Systems Development, dll. Praktisi dari manajemen proyek dari seluruh dunia akhirnya pada 2001 melakukan pertemuan untuk merumuskan nilai dasar dari Agile, kemudian disebut dengan Agile Manifesto.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Sebelum membahas isi dari Agile manifesto, kita perlu memahami definisi Agile terlebih dulu. Agile hakikatnya bukanlah sebuah metodologi diskrit, ia merupakan cara pandang yang dibangun atas nilai dan prinsip Agile. Agile juga didefinisikan sebagai pendekatan (approach) dalam manajemen proyek dengan karakter fleksibel dan adaptif. Sebagian orang salah dalam mengartikan Agile ke dalam bentuk-bentuk baku, padahal aslinya Agile adalah cara pandang atau pendekatan. Karenanya, untuk menerapkan Agile dalam proyek kita perlu memanfaatkan alat bantu atau kerangka kerja turunan Agile. Namun itu akan kita bahas untuk materi selanjutnya. Sekarang, kita kembali dulu pada Agile Manifesto. Berikut ini adalah poin-poin dari Agile Manifesto:<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li>Individuals and interaction over processes and tools<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Poin pertama menggambarkan pentingnya interaksi antar manusia dalam tim. Tim pengembang dalam metodologi agile harus lebih mencurahkan pikiran dan tenaga untuk mengelola ritme kerja mandiri (individual) sekaligus mengoptimasi kominikasi antar anggotanya, alih-alih memulai dengan prosedur dan standardisasi alat-alat penunjang.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Keanggotaan dalam tim tidak dirancang secara hirarki, dimana satu pihak perlu menerbitkan perintah sesuai birokrasi untuk menggerakkan pihak lain di 'bawahnya'. Keanggotaan dibuat secara sirkular dimana pusatnya adalah perangkat lunak. Model ini akan memungkinkan setiap orang dalam tim memiliki rasa tanggungjawab dan posisi tersendiri dalam proses pengembangan perangkat lunak. Model ini juga mendorong interaksi satu sama lain dalam anggota tim dengan setara. Tanpa menghilangkan peran (roles) spesifik setiap orang.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Poin agile manifesto pertama ini tidak menunjukkan bahwa proses dan tools tidak berguna, melainkan untuk menjelaskan bahwa proses dan alat pada dasarnya tidak akan responsif terhadap pengubahan akan kebutuhan dan keinginan customer.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li>Working software over comprehensive documentation<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Agile hadir bukan untuk mengeliminasi dokumentasi proyek pengembangan perangkat lunak, melainkan untuk mempersingkatnya. Pada metodologi tradisional, pengembangan perangkat lunak bersifat documentation driven. Kendala-kendala yang muncul dari sfiat inilah yang coba ditanggulangi untuk menghasilkan proses pengembangan yang lebih fleskibel dan adaptif. Agile tetap menerima proses modelling dan dokumentasi hanya apabila keuntungan dari proses tersebut sangat jelas dan tuntas.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li>Customer collaboration over contract negotiation<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Dalam dunia drama pengembangan perangkat lunak, customer sering digambarkan sebagai pihak yang tidak mau tahu akan proses pengembangan. Yang diinginkan adalah supaya perangkat lunak selesai tepat waktu, dana tidak bocor, dan fitur lengkap. Lalu pengembang akan banting tulang siang malam hingga begadang untuk merampungkan aplikasi 'seadanya'. Saat customer mencoba aplikasi, rupanya tidak sesuai espektasi. Meminta perbaikan pun akan sulit karena menambah waktu dan biaya. Akhirnya produk tidak pernah muncul di halaman unduhan aplikasi. Ini adalah mimpi buruk bagi customer dan developer.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Membangun perangkat lunak tidak pernah sama dengan membangun gedung bertingkat. Membuat kontrak di awal untuk membatasi waktu dan biaya malah jadi bumerang bagi semua pihak. Maka terminologi kolaborasi dijadikan jembatan untuk mempertemukan kenyataan dengan kebutuhan. Menjembatani idealisme pelanggan dengan kompleksitas teknis yang dihadapi pengembang. Setelah dijembatani, timbullah empati yang menjadi kunci dari kualitas perangkat lunak yang dikembangkan.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li>Responding to change over following a plan<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Merespon terhadap pengubahan dalam pengembangan perangkat lunak awalnya tabu dan sulit dilakukan. Atau setidaknya disimpan untuk dikerjakan entah kapan. Padahal seringkali customer baru menyadari kebutuhannya setelah keinginannya diimplementasikan dalam bentuk aplikasi. Fenomena ini yang membuat metode manajemen proyek yang berjalan sekuensial tidak lagi relevan. Dibutuhkan proses yang memfasilitasi pengubahan yang sifatnya iteratif.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Selain Agile Manifesto, ada juga prinsip Agile yang berjumlah 12. Prinsip ini adalah sebagai berikut:<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list {\"ordered\":true} --><\/p>\r\n<ol>\r\n<li><em>Our highest priority is to satisfy the customer through early and continuous delivery of valuable software<\/em>. Prioritas utama kita adalah untuk memberikan kepuasan kepada klien melalui software yang berkualitas lebih dini dan berkelanjutan.<\/li>\r\n<li><em>Welcome changing requirements, even late in development. Agile processes harness change for the customer&rsquo;s competitive advantage. <\/em>Menerima pengubahan <em>requirements <\/em>meskipun harus terlambat dalam pengembangan. Proses Agile memanfaatkan pengubahan dari pelanggan sebagai satu keuntungan kompetitif (terhadap pendekatan lain).<\/li>\r\n<li><em>Deliver working software frequently, from a couple of weeks to a couple of months, with preference to the shorter timescale. <\/em>Memberikan software yang berfungsi secara berkala, secara pekanan dan bulanan, dengan preferensi untuk mempersingkat skala waktunya.<\/li>\r\n<li><em>Business people and developers must work together daily throughout the project. <\/em>Orang-orang bisnis dan teknis (<em>developers<\/em>) harus bekerjasama secara harian selama proyek berjalan.<\/li>\r\n<li><em>Build projects around motivated individuals. Give them the environment and support the need, and trust them to get the job done. <\/em>Menjalankan proyek dengan anggota tim yang bersemangat. Berikan mereka ruang dan dukungan, percayai mereka untuk dapat menyelesaikan tugasnya.<\/li>\r\n<li><em>The most efficient and effective method of conveying information to and within a development team is face-to-face conversation. <\/em>Cara terbaik (efektif dan efisien) dalam menyampaikan informasi kepada tim pengembang adalah dengan berkomunikasi tatap muka secara langsung.<\/li>\r\n<li><em>Working software is the primary measure of progress. <\/em>Perangkat lunak yang bekerja menjadi tolak ukur utama dari progress berjalannya proyek.<\/li>\r\n<li><em>Agile processes promote sustainable development. The sponsors, developers, and users should be able to maintain a constant pace indefinitely. <\/em>Agile menawarkan pengembangan yang berkelanjutan. Sponsor, pengembang, dan pengguna harus dapat menjaga kecepatan berjalannya proyek dengan baik.<\/li>\r\n<li><em>Continuous attention to technical excellence and good design enchances agility. <\/em>Perhatian yang kontinyu terhadap masalah teknis dan desain dapat meningkatkan <em>agility <\/em>(kelincahan proyek).<\/li>\r\n<li><em>Simplicity &ndash; the art of maximizing the amount of work not done &ndash; is essential.<\/em> Kesederhanaan sangatlah penting dan mendasar.<\/li>\r\n<li><em>The best architectures, requirements, and designs emerge from self-organizing teams. <\/em>Arsitektur, <em>requirements<\/em>, dan desain timbul dari tim yang <em>self-organized <\/em>(mandiri sekaligus terorganisir).<\/li>\r\n<li><em>All regular intervals, the teams reflects on how to become more effective, then tunes and adjusts its behavior accordingly. <\/em>Setelah melewati interval waktu pengerjaan, anggota tim melakukan refleksi untuk menjadi lebih efektif dan menyesuaikan perilakunya sebagai pembelajaran untuk pengerjaan proyek selanjutnya.<\/li>\r\n<\/ol>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Apa keuntungan menggunakan Agile? Dalam Agile, kepuasan pelanggan atas kualitas produk lebih terjamin dibanding Waterfall. Mengapa begitu? Ini karena, Agile memberikan kelonggaran untuk menerima masukan akan pengubahan dari klien, walaupun itu harus memakan waktu lebih. Kualitas akan menjadi variabel yang bisa terus dikembangkan, sedangkan waktu dan biaya akan difiksasi berdasarkan iterasi yang dibutuhkan. Tapi ini sekaligus membuat Agile lebih hemat secara waktu dan biaya. Bagaimana bisa? Karena pada praktiknya, Agile memungkinkan untuk menyelesaikan produk lebih cepat meski dengan fitur bertahap. Akibatnya, klien dapat memperjelas espektasinya secara bertahap atau iteratif. Tidak menutup kemungkinan, espektasi klien terjawab lebih cepat karena proses iterasi yang dilakukan. Agile dapat menjawab masalah yang timbul akibat kompleksitas proyek yang tinggi, masalah yang tidak dapat ditangani oleh Waterfall. Dengan kompleksitas yang tinggi, pengubahan perlu dilakukan lebih banyak sekaligus rapi. Hal inilah yang dapat dijawab oleh Agile.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Namun apakah Agile cocok digunakan pada semua proyek? Apakah Agile selalu lebih unggul dibanding Waterfall?<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:file {\"id\":3453,\"href\":\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/Presentasi-Agile-dan-Sejarahnya.pptx\"} --><\/p>\r\n<div class=\"wp-block-file\"><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/Presentasi-Agile-dan-Sejarahnya.pptx\">Presentasi - Agile dan Sejarahnya<\/a><a class=\"wp-block-file__button\" href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/Presentasi-Agile-dan-Sejarahnya.pptx\" download=\"\">Unduh<\/a><\/div>\r\n<p><!-- \/wp:file --><\/p>\r\n<p>&nbsp;<\/p>\r\n<p><!-- wp:file {\"id\":2924,\"href\":\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/Agile-vs-Waterfall-1.mp4\"} --><\/p>\r\n<div class=\"wp-block-file\"><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/Agile-vs-Waterfall-1.mp4\">Video Agile vs Waterfall-1<\/a><a class=\"wp-block-file__button\" href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/Agile-vs-Waterfall-1.mp4\" download=\"\">Unduh<\/a><\/div>\r\n<p><!-- \/wp:file --> <!-- wp:paragraph --><\/p>\r\n<p>Kita coba ingat kembali bagaimana karakter dari masing-masing pendekatan. Waterfall adalah pendekatan manajemen proyek yang bersifat sekuensial. Kelebihannya adalah pada kesederhanaan dan menggambarkan kebutuhan sedetil mungkin di awal proyek. Kelemahan pendekatan ini adalah tidak bisa menangani proyek yang kompleks, dimana biasanya terdapat banyak <em>change request <\/em>di tengah-tengah keberjalanan proyek.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Agile merupakan pendekatan manajemen proyek yang bersifat adaptif. Prosesnya diawali dengan merumuskan ide kemudian mempersingkat waktu pengembangan untuk segera mendapat respon masukan, kemudian dilakukan beberapa kali pengulangan. Iterasi dan pengubahan secara berkala pada Agile dapat menjadi solusi atas kompleksitas dari proyek, dimana pemilik proyek belum dapat memberikan gambaran kebutuhan secara utuh dan detil di awal proyek.<\/p>\r\n<p>Mengatakan Agile lebih baik dari Waterfall, seperti mengatakan bahwa mobil lebih baik dari kapal. Kelebihan dan kekurangan masing-masing bergantung pada kondisi dan lingkungan penerapannya. Masing-masing memiliki kelebihan dan batasan. Waterfall sederhana dan mudah diterapkan, namun sulit mengakomodir proyek dengan kompleksitas tinggi. Agile dapat memfasilitasi proyek dengan kompleksitas menengah hingga tinggi, namun perlu usaha lebih dalam menerapkannya dalam tim.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Faktor utama menentukan pendekatan manajemen proyek adalah ketidakpastian (<em>uncertainty<\/em>). Seberapa besar ketidakpastian dalam proyek yang kita jalankan? Jika ketidakpastian rendah, lebih tepat menggunakan <em>plan-driven approach<\/em> (mudahnya, Waterfall). Sedangkan untuk proyek dengan ketidakpastian tinggi, lebih tepat menggunakan Agile.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Bagaimana kita menilai ketidakpastian dari sebuah proyek?<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Ketidakpastian sebuah proyek dinilai dari ilmu-ilmu terapan yang menjadi dasar pelaksanaan proyek. Proyek yang dibangun atas keilmuan yang cenderung tidak berubah dalam kurun waktu yang panjang lebih tepat menggunakan pendekatan Waterfall. Contohnya adalah proyek membangun jembatan. Karena sudah ada banyak <em>benchmark<\/em> perbandingan proyek lain, ditunjang oleh ilmu sipil, fisika, dan&nbsp; keilmuan lain yang sudah cukup jelas, proyek ini dapat dikategorikan sebagai proyek dengan tingkat prediksi awal yang baik. Berbeda dengan proyek untuk membuat obat kanker. Karena belum ada obatnya, maka diperlukan metode empiris dan banyak sekali percobaan <em>trial and error. <\/em>Bahkan tidak dapat diprediksi secara jelas, waktu dan biaya yang diperlukan. Maka proyek ini termasuk memiliki tingkat prediksi yang rendah.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Dalam proyek sistem informasi di era sekarang, kita akui bahwa kompleksitasnya tentu sudah sangat tinggi. Selain itu, teknologi IT yang berkembang sudah sangat cepat. Dalam tujuh tahun, mungkin teknologi IT yang kita kenal sekarang sudah digantikan. Memang masih ada proyek sistem informasi yang dikategorikan sederhana, sehingga masih tepat dalam menggunakan pendekatan Waterfall. Namun untuk proyek pembuatan aplikasi yang dapat digunakan untuk skala nasional saja, sudah membutuhkan kompleksitas yang tinggi. Maka pemahaman akan pendekatan Agile perlu ditingkatkan untuk kemudian dapat diterapkan dengan baik.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Seperti yang sudah disebutkan sebelumnya, Agile adalah cara pandang. Ia tidak tepat bila langsung digunakan dalam menunjang manajemen proyek. Perlu ada kerangka kerja yang diterapkan. Pada materi selanjutnya, akan dibahas mengenai perbandingan kerangka kerja Agile yang paling populer. Sampai jumpa pada pertemuan selanjutnya!<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:file {\"id\":3456,\"href\":\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/Presentasi-Menentukan-pendekatan-manajemen-proyek-1.pptx\"} --><\/p>\r\n<div class=\"wp-block-file\"><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/Presentasi-Menentukan-pendekatan-manajemen-proyek-1.pptx\">Presentasi - Menentukan pendekatan manajemen proyek<\/a><a class=\"wp-block-file__button\" href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/Presentasi-Menentukan-pendekatan-manajemen-proyek-1.pptx\" download=\"\">Unduh<\/a><\/div>\r\n<p><!-- \/wp:file --> <!-- wp:file {\"id\":9640,\"href\":\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Soal-Tugas-Day-2-2.docx\"} --><\/p>\r\n<div class=\"wp-block-file\"><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Soal-Tugas-Day-2-2.docx\">Soal-Tugas-Day-2<\/a><a class=\"wp-block-file__button\" href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Soal-Tugas-Day-2-2.docx\" download=\"\">Unduh<\/a><\/div>\r\n<p><!-- \/wp:file --> <!-- wp:paragraph --><\/p>\r\n<p>===<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Referensi:<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Kathy Schwalbe, <em>Information Technology Project Manajement, <\/em>7e edition.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Agile Alliance, <em>12 Principles Behind the Agile Manifesto, <\/em>available at: <a href=\"https:\/\/www.agilealliance.org\/agile101\/12-principles-behind-the-agile-manifesto\/\">https:\/\/www.agilealliance.org\/agile101\/12-principles-behind-the-agile-manifesto\/<\/a><\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p><em>The History of Agile<\/em>, available at: <a href=\"https:\/\/study.com\/academy\/lesson\/the-history-of-agile.html\">https:\/\/study.com\/academy\/lesson\/the-history-of-agile.html<\/a><\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p><em>Manifesto for Agile Software Development<\/em>, available at: <a href=\"https:\/\/agilemanifesto.org\/\">https:\/\/agilemanifesto.org\/<\/a><em>Agile Manifesto<\/em>, available at: <a href=\"https:\/\/searchcio.techtarget.com\/definition\/Agile-Manifesto\">https:\/\/searchcio.techtarget.com\/definition\/Agile-Manifesto<\/a><\/p>\r\n<p><!-- \/wp:paragraph --><\/p>","waktu_publish":"2021-10-26 08:00:00","status_publish":"publish","urutan":1,"created_by":7896,"updated_by":7896,"created_at":"2020-12-06 17:32:48","updated_at":"2021-10-24 11:21:12","waktu_publish_formatted":" Selasa, 26 Oktober 2021. 08:00:00 WIB."}]},{"id":67,"uuid":"6fbf1b9b-1783-4e7a-8469-803c99c6aaa3","materi_id":6,"nama":"Day 3","permalink":"day-3","urutan":3,"created_by":7896,"updated_by":7896,"created_at":"2020-12-06 17:33:01","updated_at":null,"posting":[{"id":209,"uuid":"c8a6b0ae-82b7-43d0-8496-92b6b8bfab4e","author_user_id":7896,"materi_section_id":67,"judul":"Day 3: Introduction to Kanban Agile Framework","permalink":"day-3-introduction-to-kanban-agile-framework","konten":"<p><!-- wp:image {\"align\":\"center\",\"id\":2927,\"sizeSlug\":\"large\"} --><\/p>\r\n<div class=\"wp-block-image\">\r\n<figure class=\"aligncenter size-large\"><img class=\"wp-image-2927\" src=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/agile-dan-turunannya-1024x705.png\" alt=\"\" \/><\/figure>\r\n<\/div>\r\n<p><!-- \/wp:image --> <!-- wp:paragraph --><\/p>\r\n<p>Pada materi sebelumnya kita sudah membahas tentang manajemen proyek dan bagaimana menentukan pendekatan manajemen proyek. Nah, pada kesempatan kali ini kita akan belajar mengenali kerangka kerja (<em>faremework<\/em>) turunan Agile. Kerangka kerja Agile yang paling populer saat ini ada tiga: Scrum, XP (<em>Extreme Programming<\/em>), dan Kanban.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Kanban dalam bahasa Jepang artinya <em>billboard. <\/em>Metode ini memang lahir di Jepang pada tahun 1940-an, dimana saat itu metode ini digunakan oleh Toyota untuk meningkatkan <em>workflow <\/em>kerjanya. Setelah diadaptasi oleh David Anderson, metode Kanban dikembangkan supaya cocok untuk digunakan oleh berbagai jenis proses <em>knowledge transfer<\/em>, seperti <em>Software Management<\/em>, <em>IT Management<\/em>, <em>Legal<\/em>, <em>Human Resources<\/em>, bahkan <em>Marketing<\/em>. Kanban juga dapat disebut sebagai <em>Visual Management Method, <\/em>dimana fokus dari metode ini adalah melakukan visualisasi atas proses manajemen yang dilakukan. Ada setidaknya empat keuntungan dasar yang akan didapat bila menerapkan metode ini: mengelola dan mengembangkan flow kerja dengan baik, melakukan optimasi waktu pengerjaan proyek, men-<em>deliver<\/em> <em>value <\/em>lebih cepat kepada <em>customer, <\/em>dan meningkatkan prediksi dan kualitas pengerjaan proyek.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Kerangka kerja ini berpusat pada cara melakukan kontrol terhadap backlog menggunakan suatu papan yang berisi setidaknya tiga kolom: <em>task to be done<\/em>, <em>task in progress<\/em>, dan <em>completed task<\/em>. Kolom tersebut mewakili proses dasar dari kegiatan yang dilakukan selama mengerjakan proyek. Tentunya proses tersebut dapat dikembangkan\/didetilkan sesuai dengan keinginan dan kesepakatan tim. Lima langkah utama yang dilakukan dalam metode ini adalah:<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>1. Memvisualisasikan <em>Workflow<\/em><\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Pada tahap ini, anda bersama tim akan menentukan alat apa yang akan digunakan untuk memvisualisasikan flow kerja. Alat fisik maupun daring tidak terlalu berpengaruh, menyesuaikan selera dan kesepakatan tim. Setelah menentukan alat, buat gambar berupa kolom -kolom yang menggambarkan proses mulai hingga selesai.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>2. Membatasi Work-In-Progress<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Buat batasan waktu terhadap pengerjaan task-task yang dilakukan. Bila tidak dibatasi, seringkali waktu pengerjaan proyek jadi terbuang sia-sia. Menentukan batasan waktu dari pekerjaan juga dapat menghasilkan prediksi waktu pengerjaan proyek secara umum.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>3. Memperjelas Kebutuhan dan Aturan<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Ini merupakan bagian dari <em>planning. <\/em>Pada proses ini, tim memahami lebih detil dan eksplisit mengenai produk yang akan dibuat. Tidak lupa untuk membahas proses bisnis dan aturan lain yang dapat mempengaruhi produk yang dihasilkan. Proses ini bagus untuk memprediksi keberjalanan proyek.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>4. Mengelola dan Mengukur Workflow<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Setelah membahas kebutuhan dari hasil produk, hal yang perlu dilakukan adalah mengelola alur kerja. Bagaimana suatu task dipecah, menentukan PIC dari setiap task, menentukan waktu pengerjaan, dan seterusnya. Dengan pace yang runut dan baik, kualitas pengerjaan proyek akan optimal.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>5. Menggunakan Metode Saintifik Sebagai Optimasi<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Setelah melaksanakan proyek menggunakan Kanban, kamu dapat membuat strategi pengerjaan untuk proyek selanjutnya. Dengan pengalaman empirik, pengerjaan proyek selanjutnya akan semakin efektif dan efisien. Maka jangan luput untuk memperhatikan pengembangan yang dapat dilakukan dari metode Kanban yang dikerjakan.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>&nbsp;<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Dalam metode Kanban, tidak ada penentuan role secara baku dalam tim. Tim bebas untuk melakukan kustomisasi pengerjaan dan pelimpahan pekerjaan atas orang-orang dalam tim. Hal ini perlu dipahami, karena merupakan ciri yang berbeda dengan metode Scrum. Dalam Scrum, ada tiga role yang diperankan oleh tim pengembang. Kita akan bahas detil pada pertemuan selanjutnya.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Metode ini dapat diterapkan dengan berbagai alat. Mulai dari yang alat fisik sederhana seperti papan tulis + sticky notes, hingga <em>software online <\/em>seperti Trello semacamnya. Penggunaan alat tersebut dapat disesuaikan dengan kondisi dan selera dari tim pengembang yang mempraktekkan proses Kanban.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Karena kelas kita kedepannya akan mendalami tentang Scrum, maka akan sedikit diberikan gambaran akan perbandingan antara Kanban dan Scrum. Perbandingan tersebut akan dijabarkan pada tabel berikut.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:table --><\/p>\r\n<figure class=\"wp-block-table\">\r\n<table>\r\n<tbody>\r\n<tr>\r\n<td>No<\/td>\r\n<td>Faktor Pembanding<\/td>\r\n<td>Scrum<\/td>\r\n<td class=\"has-text-align-left\" data-align=\"left\">Kanban<\/td>\r\n<\/tr>\r\n<tr>\r\n<td>1<\/td>\r\n<td>Proses<\/td>\r\n<td>Berjalan dengan menyesuaikan waktu Sprint<\/td>\r\n<td class=\"has-text-align-left\" data-align=\"left\">Berjalan mengalir secara kontinyu<\/td>\r\n<\/tr>\r\n<tr>\r\n<td>2<\/td>\r\n<td>Prioritas<\/td>\r\n<td>Task diambil dari product backlog secara berkala untuk membentuk sprint backlog<\/td>\r\n<td class=\"has-text-align-left\" data-align=\"left\">Tim memberikan set fitur berdasarkan kebutuhan dasar, kemudian merancang task baru setelah tugas sebelumnya selesai.<\/td>\r\n<\/tr>\r\n<tr>\r\n<td>3<\/td>\r\n<td>Roles (Peran)<\/td>\r\n<td>Anggota tim memiliki peran dan tanggungjawab masing-masing<\/td>\r\n<td class=\"has-text-align-left\" data-align=\"left\">Anggota tidak diwajibkan berperan atau bertanggungjawab secara kaku, tim didorong untuk berkolaborasi<\/td>\r\n<\/tr>\r\n<tr>\r\n<td>4<\/td>\r\n<td>Modification (Pengubahan)<\/td>\r\n<td>Modifikasi dapat dilakukan hanya apabila proses Sprint selesai. Modifikasi yang membahayakan Sprint Goals, tidak diterima untuk dilaksanakan<\/td>\r\n<td class=\"has-text-align-left\" data-align=\"left\">Modifikasi (change requirements) dapat dilakukan setiap waktu dalam masa pengembangan<\/td>\r\n<\/tr>\r\n<\/tbody>\r\n<\/table>\r\n<\/figure>\r\n<p><!-- \/wp:table --> <!-- wp:paragraph --><\/p>\r\n<p>Ada tiga poin penting yang dapat disimpulkan dari tabel di atas. Pertama, Scrum dan Kanban menjadi framework dari pendekatan Agile yang efisien dalam pengembangan perangkat lunak. Kedua, Scrum lebih ketat mengatur masalah peran dan <em>timeline<\/em>, meskipun tetap fleksibel dan dapat beradaptasi dalam berbagai kondisi proyek.&nbsp; Ketiga, Karena Scrum lebih terstruktur dan prediktif, klien biasanya lebih dapat mengikuti alur kerja dan mudah memahami kondisi proyek sewaktu-waktu.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:file {\"id\":9720,\"href\":\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Agiles-Framework-Kanban.pdf\"} --><\/p>\r\n<div class=\"wp-block-file\"><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Agiles-Framework-Kanban.pdf\">Agiles-Framework-Kanban<\/a><a class=\"wp-block-file__button\" href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Agiles-Framework-Kanban.pdf\" download=\"\">Unduh<\/a><\/div>\r\n<p><!-- \/wp:file --> <!-- wp:file {\"id\":9050,\"href\":\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Soal-Tugas-Day-3.docx\"} --><\/p>\r\n<div class=\"wp-block-file\"><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Soal-Tugas-Day-3.docx\">Soal-Tugas-Day-3<\/a><a class=\"wp-block-file__button\" href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Soal-Tugas-Day-3.docx\" download=\"\">Unduh<\/a><\/div>\r\n<p><!-- \/wp:file --> <!-- wp:paragraph --><\/p>\r\n<p>referensi:<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:core-embed\/wordpress {\"url\":\"https:\/\/gbksoft.com\/blog\/scrum-vs-other-methodologies\/\",\"type\":\"wp-embed\",\"providerNameSlug\":\"web-and-mobile-apps-development-blog-articles-news\",\"className\":\"\"} --><\/p>\r\n<figure class=\"wp-block-embed-wordpress wp-block-embed is-type-wp-embed is-provider-web-and-mobile-apps-development-blog-articles-news\">\r\n<div class=\"wp-block-embed__wrapper\">https:\/\/gbksoft.com\/blog\/scrum-vs-other-methodologies\/<\/div>\r\n<\/figure>\r\n<p><!-- \/wp:core-embed\/wordpress --> <!-- wp:paragraph --><\/p>\r\n<p><a href=\"https:\/\/medium.com\/@mikesebastian\/extreme-programming-c715e6b8e0e9\">https:\/\/medium.com\/@mikesebastian\/extreme-programming-c715e6b8e0e9<\/a><\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p><a href=\"https:\/\/hygger.io\/blog\/5-steps-of-kanban-implementation\/\">https:\/\/hygger.io\/blog\/5-steps-of-kanban-implementation\/<\/a><\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Kathy Schwalbe, <em>Information Technology Project Management, 73 edition.<\/em><\/p>\r\n<p><!-- \/wp:paragraph --><\/p>","waktu_publish":"2021-10-27 08:00:00","status_publish":"publish","urutan":1,"created_by":7896,"updated_by":7896,"created_at":"2020-12-06 17:34:11","updated_at":"2021-10-24 11:21:26","waktu_publish_formatted":" Rabu, 27 Oktober 2021. 08:00:00 WIB."}]},{"id":68,"uuid":"c6b27921-11f2-4bca-ba9c-d87425a79462","materi_id":6,"nama":"Day 4","permalink":"day-4","urutan":4,"created_by":7896,"updated_by":7896,"created_at":"2020-12-06 17:33:07","updated_at":null,"posting":[{"id":210,"uuid":"f2720a00-8244-4978-b8a2-7cfdf003255f","author_user_id":7896,"materi_section_id":68,"judul":"Day 4: Introduction to XP Agile Framework","permalink":"day-4-introduction-to-xp-agile-framework","konten":"<p><!-- wp:paragraph --><\/p>\r\n<p>Pada materi sebelumnya, kita telah mengenal salah satu kerangka kerja Agile yaitu Kanban. Selain Kanban, ada juga kerangka kerja yang cukup banyak dikenal dan digunakan dalam dunia <em>software development<\/em>: Extreme Programming. Metode ini dikenalkan oleh Kent Back sebagai metode pengembangan software development yang cepat, efisien, beresiko rendah, fleksibel, terprediksi, saintifik, dan menyenangkan. XP cocok digunakan oleh tim kecil-menengah atau dengan sedikit programmer, dimana kebutuhan produk sangat abstrak atau sering berubah-ubah.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>XP memiliki empat <em>core values: communication<\/em>, <em>simplicity, feedback, <\/em>dan <em>courage.<\/em><\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p><em>Communication <\/em>(komunikasi) sebagai nilai pertama dalam XP diterapkan dengan memfokuskan hubungan yang baik antara tim dengan klien, anggota dalam tim, serta tim dengan manajer proyek atau bagian lain. Salah satu bentuk komunikasi yang intens dalam XP adalah penerapan <em>pair programming.<\/em><\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p><em>Simplicity <\/em>(kesederhanaan)sebagai nilai kedua dalam XP maksudnya adalah dengan membuat segala sesuatu dalam pengembangan menjadi sesederhana mungkin. Misalnya adalah membuang fungsi atau halaman yang tidak digunakan, fokus pada kebutuhan utama dari aplikasi, tidak terlalu rumit dalam membuat desain dan banyak contoh lainnya. Intinya, fokus pada hal sederhana yang dibutuhkan sekarang dan mengembangkannya di kemudian hari bila dirasa perlu.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p><em>Feedback <\/em>(umpan balik) sebagai nilai ketiga dalam XP maksudnya adalah untuk selalu melakukan evaluasi terhadap produk yang dikerjakan. Informasi dan kesalahan produk perlu dikumpulkan selama keberjalanan proyek, kemudian dibahas solusinya secara rutin. Umpan balik juga dapat menjadi indikator perkembangan dari proyek yang sedang dijalankan.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p><em>Courage <\/em>(keberanian) sebagai nilai keempat dalam XP maksudnya adalah mendorong programmer untuk berani bereksperimen dan menulis ulang kode bila tidak puas dengan hasil sebelumnya. Ini membantu mempertahankan moral dan integritas pengembang proyek serta mendorong komunikasi lebih lanjut dengan anggota proyek lain.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Selanjutnya mari kita bahas tahapan dalam metode XP: <em>Planning<\/em>, <em>Design<\/em>, <em>Coding<\/em>, dan <em>Testing<\/em>.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p><em>Planning<\/em> adalah tahap dimana tim membahas mengenai <em>user story <\/em>untuk <em>software increment<\/em> (rilis) berikutnya. Tim akan menentukan bobot dan prioritas <em>story <\/em>untuk diimplementasikan. Biasanya <em>story <\/em>dengan <em>value <\/em>atau risiko tinggi akan diimplementasikan lebih dulu. Pada tahap ini juga dibuat perhitungan kecepatan pelaksanaan pengerjaan proyek untuk satu <em>increment<\/em>.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p><em>Design <\/em>adalah tahap merancang <em>object oriented class <\/em>yang sesuai dengan <em>software increment. <\/em>Karena kental dengan <em>object oriented programming, <\/em>proses ini banyak melakukan perancangan kelas dan objek untuk perangkat lunak. Biasanya desain dibantu dengan penggunaan Class Diagram, CRC <em>Card<\/em> (<em>Class Responsibilities Collaboration<\/em>), dan Use Case Diagram.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p><em>Coding <\/em>adalah tahap membangun aplikasi atau produk. Dalam XP ada konsep untuk membangun kode menggunakan metode <em>pair programming. <\/em>Metode ini dilakukan oleh dua programmer menggunakan satu workstation. Ada yang berperan sebagai <em>observer <\/em>dan <em>navigator. <\/em>Dengan metode ini, harapannya kode dapat dibangun dengan lebih cepat dan efisien (secara algoritma) melalui <em>knowledge sharing <\/em>yang dilakukan oleh <em>observer <\/em>dan <em>navigator. <\/em>Dalam proses ini juga sebaiknya dilakukan persiapan unit testing berdasarkan kode yang dibangun. Unit testing akan diimplementasikan pada proses selanjutnya.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p><em>Testing <\/em>adalah tahap untuk menguji program yang dibangun. Testing biasanya dilakukan secara internal tim dan external (<em>Acceptance Test<\/em>). Tes internal dibangun untuk mengecek setiap fungsional dalam program. Tes dapat menggunakan suatu framework otomasi, sehingga tes dapat dilakukan berulang-ulang setiap hari dengan mudah. <em>Acceptance test <\/em>dilakukan <em>customer <\/em>untuk mengetes kesesuaian <em>user story.<\/em><\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>XP cocok digunakan untuk membangun program\/software dengan karakter sebagai berikut:<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li>Membutuhkan perubahan cepat<\/li>\r\n<li>Proyek beresiko tinggi atau memiliki tantangan berat<\/li>\r\n<li>Programmer sedikit (2-10 orang)<\/li>\r\n<li>Adanya permintaan dari pelanggan secara langsung<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Kelebihan penggunaan XP adalah sebagai berikut:<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li>Meningkatkan kepuasan klien<\/li>\r\n<li>Membangun sistem dengan lebih cepat<\/li>\r\n<li>Menjalin komunikasi yang baik dengan klien<\/li>\r\n<li>Meningkatkan komunikasi dan rasa saling menghargai antar developer<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Kelemahan dari penggunaan XP adalah sebagai berikut:<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li>Cerita atau requirements awal seringkali tidak lengkap, sehingga tim pengembang harus siap dengan pengubahan yang akan diberikan<\/li>\r\n<li>Tidak bisa membuat kode dengan detil di awal (karena mendahulukan <em>simplicity<\/em>)<\/li>\r\n<li>Tidak memiliki bentuk dokumentasi formal<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Selanjutnya kita akan membahas perbandingan antara Scrum dan XP. Perbandingan tersebut akan dijabarkan pada tabel berikut.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:table --><\/p>\r\n<figure class=\"wp-block-table\">\r\n<table>\r\n<tbody>\r\n<tr>\r\n<td>No<\/td>\r\n<td>Faktor Pembanding<\/td>\r\n<td>Scrum<\/td>\r\n<td>Extreme Programming<\/td>\r\n<\/tr>\r\n<tr>\r\n<td>1<\/td>\r\n<td>Fokus<\/td>\r\n<td>Fokus secara big picture, bagaimana mereka terorganisir<\/td>\r\n<td>Fokus berurusan pada teknik pemrograman yntuk menyelesaikan produk<\/td>\r\n<\/tr>\r\n<tr>\r\n<td>2<\/td>\r\n<td>Product Backlog<\/td>\r\n<td>Sprint backlog tidak berubah hingga akhir Sprint<\/td>\r\n<td>Tim dapat menukar isi backlog dalam sebuah iterasi<\/td>\r\n<\/tr>\r\n<tr>\r\n<td>3<\/td>\r\n<td>Roles (Peran)<\/td>\r\n<td>Peran dan tanggungjawab diregulasi untuk dapat menjalankan Sprint<\/td>\r\n<td>Tidak menentukan secara baku peran dan proses pengembangan<\/td>\r\n<\/tr>\r\n<\/tbody>\r\n<\/table>\r\n<\/figure>\r\n<p><!-- \/wp:table --> <!-- wp:paragraph --><\/p>\r\n<p>Perbedaan utama Scrum dan XP terletak pada fokus. Scrum fokus kepada keseluruhan proyek, XP fokus pada teknik pemrograman. Namun tidak dipungkiri bahwa perbedaan tersebut tetap memiliki irisan. Artinya, Scrum juga membahas teknik pemrograman, XP juga akan bicara mengenai <em>big picture<\/em> dari proyek. Dari sudut pandang klien, Scrum memberikan lebih banyak benefit karena prosesnya transparan, jelas, dan terorganisir. Sedangkan pada XP, proses cenderung berorientasi kepada internal tim atau programmer, sehingga klien seringkali sulit untuk memahami kondisi protek sewaktu-waktu.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:file {\"id\":9803,\"href\":\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Agile-Framework-Extreme-Programming-1.pptx\"} --><\/p>\r\n<div class=\"wp-block-file\"><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Agile-Framework-Extreme-Programming-1.pptx\">Agile-Framework-Extreme-Programming<\/a><a class=\"wp-block-file__button\" href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Agile-Framework-Extreme-Programming-1.pptx\" download=\"\">Unduh<\/a><\/div>\r\n<p><!-- \/wp:file --> <!-- wp:file {\"id\":9057,\"href\":\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Soal-Tugas-Day-4-1.docx\"} --><\/p>\r\n<div class=\"wp-block-file\"><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Soal-Tugas-Day-4-1.docx\">Soal-Tugas-Day-4<\/a><a class=\"wp-block-file__button\" href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Soal-Tugas-Day-4-1.docx\" download=\"\">Unduh<\/a><\/div>\r\n<p><!-- \/wp:file --> <!-- wp:paragraph --><\/p>\r\n<p>referensi:<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:core-embed\/wordpress {\"url\":\"https:\/\/gbksoft.com\/blog\/scrum-vs-other-methodologies\/\",\"type\":\"wp-embed\",\"providerNameSlug\":\"web-and-mobile-apps-development-blog-articles-news\",\"className\":\"\"} --><\/p>\r\n<figure class=\"wp-block-embed-wordpress wp-block-embed is-type-wp-embed is-provider-web-and-mobile-apps-development-blog-articles-news\">\r\n<div class=\"wp-block-embed__wrapper\">https:\/\/gbksoft.com\/blog\/scrum-vs-other-methodologies\/<\/div>\r\n<\/figure>\r\n<p><!-- \/wp:core-embed\/wordpress --> <!-- wp:paragraph --><\/p>\r\n<p><a href=\"https:\/\/medium.com\/@mikesebastian\/extreme-programming-c715e6b8e0e9\">https:\/\/medium.com\/@mikesebastian\/extreme-programming-c715e6b8e0e9<\/a><\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Kathy Schwalbe, <em>Information Technology Project Management, 73 edition.<\/em><\/p>\r\n<p><!-- \/wp:paragraph --><\/p>","waktu_publish":"2021-10-28 08:00:00","status_publish":"publish","urutan":1,"created_by":7896,"updated_by":7896,"created_at":"2020-12-06 17:35:32","updated_at":"2021-10-24 11:21:39","waktu_publish_formatted":" Kamis, 28 Oktober 2021. 08:00:00 WIB."}]},{"id":69,"uuid":"dc59f52a-1203-486a-ad77-8b89d2ac3051","materi_id":6,"nama":"Day 5","permalink":"day-5","urutan":5,"created_by":7896,"updated_by":7896,"created_at":"2020-12-06 17:33:15","updated_at":"2021-08-15 13:40:41","posting":[{"id":211,"uuid":"8da7945c-3537-473a-8935-56d30d8e2db7","author_user_id":7896,"materi_section_id":69,"judul":"Introduction to Scrum Agile Framework","permalink":"introduction-to-scrum-agile-framework","konten":"<p><!-- wp:paragraph --><\/p>\r\n<p>Pada materi sebelumnya, kita telah membahas mengenai Agile sebagai metodologi, dan telah berkenalan dengan beberapa kerangka kerja yang lain seperti kanban dan XP. Dengan mengetahui bahwa terdapat kerangka kerja seperti kanban dan Xp, kita mengetahui bahwa metodologi dan nilai-nilai agile saja tidak cukup untuk dapat melakukan pengembangan produk atau menjalankan proyek dengan metodologi agile saja. Hal ini disebabkan karena agile tidak mengatur secara khusus mengenai bagaimana penerapan prinsip prinsip yang ada secara praktikal. Untuk itu, dibutuhkan kerangka kerja <em>(Framework) <\/em>untuk&nbsp; dapat menerapkan prinsip prinsip tersebut.&nbsp;<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Seperti judulnya, materi hari ini lebih banyak berisi pengenalan mengenai cara kerja scrum.&nbsp; Pada materi hari ini, kita akan memperkenalkan&nbsp; istilah-istilah yang ada di scrum untuk menyamakan definisi. Setelah itu, kita baru akan menggali materi scrum lebih dalam lagi. Untuk memudahkan teman-teman dalam mengingat definisi yang terdapat dalam scrum, seluruh definisi dalam pelatihan ini dikumpulkan menjadi satu pada materi <strong>daftar istilah dalam scrum<\/strong><strong>.&nbsp;<\/strong>Sekarang, yuk coba kita berkenalan dengan cara kerja scrum.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p><strong>Pengenalan Scrum<\/strong><\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Sebelumnya, kita sudah membahas banyak mengenai proyek dan cara pengerjaannya. Scrum merupakan salah satu kerangka kerja yang populer dalam &nbsp;manajemen proyek berbasis agile. Banyak metodologi lain selain scrum yang sebenarnya dapat dipelajari selain scrum. Berikut merupakan beberapa framework yang masih berada dalam naungan agile.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:image {\"id\":4323,\"sizeSlug\":\"large\"} --><\/p>\r\n<figure class=\"wp-block-image size-large\"><img class=\"wp-image-4323 aligncenter\" src=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/AgileUmbrella.png\" alt=\"Agile Marketing: Lightweight or a fuller approach? | nMerge\" width=\"441\" height=\"300\" \/>\r\n<figcaption><\/figcaption>\r\n<\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:paragraph --><\/p>\r\n<p>Apabila dilihat, banyak sekali metode yang dpat digunakan, mulai dari scrum, extreme programming, test driven development, bahkan beberapa versi scrum yang di extend untuk penggunaan skala yang lebih besar. Berdasarakan data dari survey yang dilakukan <a href=\"https:\/\/www.scrumalliance.org\/learn-about-scrum\/state-of-scrum\">ScrumAlliance.com<\/a>, 94% dari manajemen proyek berbasis agile dilakukan dengan menggunakan scrum, dengan 78% nya menggunakan scrum bersamaan dengan pendekatan lain, dan 16% nya menggunakan scrum secara eksklusif. Dari data ini, dapat dilihat bahwa scrum sebenarnya merupakan cara kerja yang digunakan hampir di sebagian besar proyek berbasis agile. Meskipun beberapa perusahaan menggunakan metode selain scrum, akan tetapi secara umum, mayoritas tetap menggunakan scrum sebagai metode manajemen proyeknya dan dipadukan dengan framework lainnya.<\/p>\r\n<p><img class=\"aligncenter wp-image-9408 size-full\" src=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Screen-Shot-2020-08-23-at-16.52.41.png\" alt=\"Agile Scrum Implementation \" width=\"301\" height=\"196\" \/><\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p><strong>Mengapa Menggunakan Scrum<\/strong><\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Sebelum masuk ke pembahasan mengenai Scrum, kita butuh untuk mengetahui apakah scrum merupakan metodologi yang cocok untuk digunakan atau tidak ?? mengapa tidak menggunakan metode metode lain seperti XP, Kanban, dan lainnya. &nbsp;Berikut merupakan beberapa alasan yang menjelaskan keuntungan dari penggunaan metode scrum.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list {\"ordered\":true} --><\/p>\r\n<ol>\r\n<li>&nbsp;<strong>Adaptabilitas <\/strong>Proyek \/ Produk yang dikembangkan dengan metodologi scrum, memiliki adaptabilitas yang tinggi terhadap perubahan.<\/li>\r\n<li><strong>Transparency <\/strong>Transparansi dalam pengerjaan tugas dapat dilihat oleh siapapun, tidak hanya pada orang orang yang mengerjakan proyek saja.Hal ini dapat dilihat dari adanya <strong><em>scrum<\/em><\/strong><em> <strong>board<\/strong><\/em><strong>, <em>burn down chart<\/em><\/strong>, <strong><em>velocity,<\/em><\/strong> dan lainnya.<\/li>\r\n<li><strong>Continuous Feedback <\/strong>Kerangka kerja scrum memungkinkan adanya <em>saran perbaikan <\/em>yang terus menerus karena telah terintegrasi dalam kerangka kerja. Hal ini ditunjukkan dengan <strong><em>daily standups<\/em><\/strong><em>, <\/em>kemudian<em> <strong>Sprint Review &amp; Retrospective.<\/strong><\/em><\/li>\r\n<li><strong>Continuous Impovement <\/strong>Kerangka kerja scrum melakukan pengembangan dengan cara <strong>iterative <\/strong>menggunakan <strong>sprint<\/strong>, sesuai kebutuhan bisnis yang didasarkan dari <strong>product backlog.<\/strong><\/li>\r\n<li><strong>Continuous Delivery of Value <\/strong>Kerangka kerja scrum selalu memberikan hasil berupa <strong>increment <\/strong>pada setiap akhir sprint nya. Dan hasil yang diberikan ini akan selalu memiliki value karena dikerjakan berdasarkan urutan <strong>product backlog<\/strong> yang telah diprioritaskan.<\/li>\r\n<li><strong>Sustainable Pace <\/strong>Walaupun adaptif terhadap perubahan, kerangka kerja scrum juga tidak didesain untuk memberatkan dari sisi <strong>tim pengerjaan proyek.<\/strong> Hal ini karena setiap sprint dalam scrum selalu diestimasi dan dinilai dari tingkat kesulitan pekerjaannya, dan perubahan memiliki cara tersendiri untuk disampaikan (<strong>Dalam product backlog)<\/strong>.<\/li>\r\n<li><strong>Each Delivery of High Value <\/strong>Dalam kerangka kerja scrum <strong>product backlog<\/strong> yang masuk pada <strong>sprint<\/strong> akan selalu diurutkan berdasarkan prioritas oleh <strong>Product Owner<\/strong>. Sehingga hal ini akan memberikan value terbaik untuk user pada setiap iterasinya.<\/li>\r\n<li><strong>Efficient Development Process <\/strong>Kerangka kerja scrum memiliki batas waktu dari meeting, dan juga meminimalisir pekerjaan yang tidak perlu sehingga setiap anggota bisa fokus dalam pengerjaan proyek \/ pengembangan produk.<\/li>\r\n<li><strong>Motivation <\/strong>Dalam kerangka kerja scrum terdapat proses yang mengevaluasi cara kerja untuk dapat memperbaiki pekerjaan pada sprint berikutnya. Perbaikan yang dilakukan secara terus menerus ini dapat membantu meningkatkan kinerja dari tim secara keseluruhan<\/li>\r\n<li><strong>Faster Problem Resolution <\/strong>Dalam kerangka kerja scrum, sebuah tim terdiri dari <strong>cross functional team <\/strong>yang saling berkolaborasi sehingga resolusi dari sebuah masalah dapat diselesaikan lebih cepat<\/li>\r\n<li><strong>Effective Deliverables <\/strong>Proses Prioritisasi Backlog dan Review yang dilakukan secara regular memastikan deliverables yang diberikan oleh tim kepada user efektif<\/li>\r\n<li><strong>Customer Centric <\/strong>Kerangka kerja scrum menekankan pada nilai bisnis dari sebuah pekerjaan dan pendekatan yang kolaboratif sehingga memastikan user menjadi prioritas utama.<\/li>\r\n<li><strong>High Trust Environment <\/strong>Adanya kegiatan <strong>Retrospective &amp; Daily Standups <\/strong>meningkatkan transparansi dalam tim, yang pada akhirnya meningkatkan kepercayaan antara satu anggota proyek dengan yang lain.<\/li>\r\n<li><strong>Collective Ownership <\/strong>Kerangka kerja scrum membuat tim proyek dapat ikut punya kepemilikan bersama dalam proyek &nbsp;dilihat dari <strong>user story<\/strong>. Tim proyek secara bersama sama akan berusaha menyelesaikan user story yang diambil dalam satu sprint.<\/li>\r\n<li><strong>High Velocity <\/strong>Kerangka kerja scrum yang menekankan pada kolaborasi tim cross functional membuat tim dapat mengeluarkan potensi terbaiknya.<\/li>\r\n<li><strong>Innovative Environment <\/strong>Kerangka kerja scrum memiliki retrospective dan review yang dapat dijadikan sarana untuk belajar, introspeksi dan adaptif sehingga dapat memunculkan lingkungan yang inovatif<\/li>\r\n<\/ol>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Berdasarkan penjabaran diatas, 16 keuntungan yang dipaparkan adalah hal hal yang kamu harusnya harapkan, ketika nanti kamu sudah mengimplementasikan scrum kepada cara kerja kamu. Setelah membaca alasan alasan diatas, pasti ada beberapa istilah kan yang temen-temen mungkin baru dengar selama ini. Beberapa definisi yang ditandai diatas, merupakan istilah yang harus kita sama sama pahami dulu nih sebelum lebih lanjut belajar mengenai scrum. Lalu ada istilah apa aja sebenarnya dalam scrum ? Coba buka Daftar istilah yang ada pada link&nbsp;<strong>Daftar istilah<\/strong><strong>&nbsp;<\/strong> untuk memahami daftar istilah dalam scrum yang ada supaya kita dapat memahami lebih mudah materi ini kedepannya.&nbsp;Setelah mengetahui definisi yang ada, sekarang kamu mungkin dapat sedikit gambaran mengenai materi scrum ini dan apa yang akan kita pelajari kedepannya.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Nah, untuk memberikan kamu gambaran lebih, materi scrum yang akan diberikan pada pertemuan berikutnya akan dibagi menjadi beberapa bahasan. Berikut merupakan beberapa bagian tersebut.&nbsp;<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:image {\"id\":4326,\"sizeSlug\":\"large\"} \/--> <!-- wp:paragraph --><\/p>\r\n<ol>\r\n<li><strong>Scrum Principle<br \/><\/strong>Scrum Principle merupakan hal yang wajib ada dalam scrum. Seluruh prinsip dalam&nbsp;<strong><em>scrum principle&nbsp;<\/em><\/strong>harus dijalankan apabila kamu ingin menerapkan kerangka kerja scrum. apabila tidak diimplementasikan seluruhnya, maka tim kamu tidak dapat dikatakan menggunakan kerangka kerja scrum.<br \/><br \/><\/li>\r\n<li><strong>Scrum Value<br \/><\/strong>Scrum Value merupakan nilai nilai yang harus diterapkan dalam masing-masing individu tim scrum dan akan menentukan kesuksesan tim dalam menerapkan kerangka kerja scrum ini. Pada materi ini akan dibahas lebih banyak mengenai kualitas individu seperti apa yang sudah siap untuk menerapkan kerangka kerja scrum.<\/li>\r\n<li><strong> Scrum Team<br \/><\/strong>Pada Scrum Team ini, akan dibahas mengenai peran peran apa saja yang ada dalam kerangka kerja scrum. Secara umum scrum hanya mengenal 3 peran utama, yaitu Product Owner, Scrum Master, dan Development Team.&nbsp;<br \/><br \/><\/li>\r\n<li><strong>Scrum Event \/ Process&nbsp;<br \/><\/strong>Scrum Process ini membahas mengenai kegiatan apa saja yang ada dalam scrum dan merupakan materi utama dari pembelajaran&nbsp;<em>agile development using scrum ini<\/em>. kita akan membahas apa yang harus dilakukan dalam masing-masing proses, dan apa saja hal yang harus dipersiapkan sebelum memulai suatu proses dalam scrum.<br \/><br \/><\/li>\r\n<li><strong>Scrum Implementation Using Tools<br \/><\/strong>Pada materi ini, akan diberikan sedikit contoh untuk mulai menerapkan scrum dengan menggunakan tools management seperti&nbsp;<em>trello, JIRA, monday.com, clickup.&nbsp;<\/em>Penerapan akan berfokus kepada bagaimana cara untuk mempersiapkan hal hal yang dibutuhkan sebelum memulai kerangka kerja scrum menggunakan tools apapun.<br \/><br \/><\/li>\r\n<li><strong>Introduction to Product Management<br \/><\/strong>Pada materi ini, kita akan belajar sedikit mengenai peran scrum dalam pengembangan produk, dan bagaiman scrum dapat berguna dalam meningkatkan kecepatan pengembangan produk.&nbsp;Terdapat bonus materi mengenai product development yang disertakan dalam materi ini.<\/li>\r\n<\/ol>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list {\"ordered\":true} \/--> <!-- wp:paragraph --><\/p>\r\n<p>Gimana teman-teman ? Sudah tidak sabar untuk pertemuan berikutnya ?<\/p>\r\n<p>Sekian dan terimakasih :D<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:file {\"id\":9828,\"href\":\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Soal-Tugas-Day-5.docx\"} --><\/p>\r\n<div class=\"wp-block-file\"><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Soal-Tugas-Day-5.docx\"><br \/>Soal-Tugas-Day-5<\/a><a class=\"wp-block-file__button\" href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Soal-Tugas-Day-5.docx\" download=\"\">Unduh<\/a><\/div>\r\n<p><!-- \/wp:file --> <!-- wp:file {\"id\":9830,\"href\":\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/PPT-Hari-ke-5.pdf\"} --><\/p>\r\n<div class=\"wp-block-file\"><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/PPT-Hari-ke-5.pdf\">PPT-Hari-ke-5<\/a><a class=\"wp-block-file__button\" href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/PPT-Hari-ke-5.pdf\" download=\"\">Unduh<\/a><\/div>\r\n<p><!-- \/wp:file --><\/p>","waktu_publish":"2021-10-29 08:00:00","status_publish":"publish","urutan":1,"created_by":7896,"updated_by":7896,"created_at":"2020-12-06 17:36:38","updated_at":"2021-10-24 11:21:51","waktu_publish_formatted":" Jumat, 29 Oktober 2021. 08:00:00 WIB."},{"id":212,"uuid":"d528406e-2238-4502-b47c-ebec44e13360","author_user_id":7896,"materi_section_id":69,"judul":"Daftar Definisi dan Istilah","permalink":"daftar-definisi-dan-istilah","konten":"<p>Berikut merupakan istilah dan definisi yang dapat teman-teman jadikan referensi selama pelatihan materi kerangka kerja scrum ini.<\/p>\r\n<p>Sprint = Sprint bisa dikatakan sebagai sebuah mini proyek. 1 Sprint merupakan serangkaian satu siklus iterasi pengembangan dalam scrum yang menghasilkan sebuah <strong>increment<\/strong>.<\/p>\r\n<p>Sprint Planning = kegiatan perencanaan proyek dalam scrum<\/p>\r\n<p>Sprint Retrospective = kegiatan evaluasi cara kerja dalam scrum<\/p>\r\n<p>Sprint Review = kegiatan evaluasi hasil pekerjaan dvelopment team<\/p>\r\n<p>Daily Standup = Meeting harian dalam scrum untuk sinkronisasi tim<\/p>\r\n<p>Product Backlog = Daftar kebutuhan yang yang terurut berdasarkan prioritas<\/p>\r\n<p>Sprint Backlog = daftar kebutuhan yang dikerjakan dalam satu sprint<\/p>\r\n<p>User Story = Cara untuk mendapatkan kebutuhan dari user<\/p>\r\n<p>Velocity = kecepatan pengembangan produk\/proyek dari suatu tim<\/p>\r\n<p>Tech Debt = merupakan istilah \"hutang teknis\" dimana terkadang untuk menerapkan sesuatu dalam waktu singkat, beberapa jalan pintas digunakan<\/p>\r\n<p>Product Owner = seseorang yang bertanggungjawab terhadap produk<\/p>\r\n<p>Scrum Master = seseorang yang menjamin implementasi scrum<\/p>\r\n<p>Development Team = tim yang mengembangkan \/ mengerjakan proyek \/ produk<\/p>\r\n<p>&nbsp;<\/p>","waktu_publish":"2021-10-29 08:00:00","status_publish":"publish","urutan":2,"created_by":7896,"updated_by":7896,"created_at":"2020-12-06 17:50:01","updated_at":"2021-10-24 11:22:08","waktu_publish_formatted":" Jumat, 29 Oktober 2021. 08:00:00 WIB."},{"id":213,"uuid":"af62387e-ee6d-40f5-a090-f88a7f58997e","author_user_id":7896,"materi_section_id":69,"judul":"Materi Referensi","permalink":"materi-referensi","konten":"<p>Untuk memudahkan teman-teman dalam akses materi, referensi materi dalam kursus ini dikompilasi menjadi satu post pada post ini. berikut merupakan kompilasi materi referensi yang digunakan dalam pelatihan agile development using scrum :<\/p>\r\n<ul>\r\n<li>Scrum Body of Knowledge ebook :<br \/><a href=\"https:\/\/www.scrumstudy.com\/sbokguide\/overview-of-sbok\">https:\/\/www.scrumstudy.com\/sbokguide\/overview-of-sbok<\/a><\/li>\r\n<li>ScrumGuide ebook :<br \/><a href=\"https:\/\/www.scrumguides.org\/scrum-guide.html\">https:\/\/www.scrumguides.org\/scrum-guide.html<\/a><\/li>\r\n<li>ScrumAlliance scrum Material :<br \/><a href=\"https:\/\/www.scrumalliance.org\/about-scrum\/team\">https:\/\/www.scrumalliance.org\/about-scrum\/team&nbsp;<\/a><\/li>\r\n<li>Scrum Values<br \/><a href=\"https:\/\/www.scrum.org\/resources\/blog\/5-scrum-values-take-center-stage\">https:\/\/www.scrum.org\/resources\/blog\/5-scrum-values-take-center-stage<\/a><\/li>\r\n<li>Product Backlog Prioritization<br \/><a href=\"https:\/\/foldingburritos.com\/product-prioritization-techniques\/\">https:\/\/foldingburritos.com\/product-prioritization-techniques\/<\/a><\/li>\r\n<li>Product Vision<br \/><a href=\"https:\/\/www.scrum.org\/resources\/blog\/10-tips-product-owners-product-vision\">https:\/\/www.scrum.org\/resources\/blog\/10-tips-product-owners-product-vision<\/a><\/li>\r\n<\/ul>","waktu_publish":"2021-10-29 08:00:00","status_publish":"publish","urutan":3,"created_by":7896,"updated_by":7896,"created_at":"2020-12-06 17:51:35","updated_at":"2021-10-24 11:22:21","waktu_publish_formatted":" Jumat, 29 Oktober 2021. 08:00:00 WIB."}]},{"id":87,"uuid":"46d5bde4-331d-46f8-8550-738c3993db44","materi_id":6,"nama":"Day 6","permalink":"day-6","urutan":6,"created_by":8100,"updated_by":8100,"created_at":"2020-12-07 10:44:46","updated_at":"2021-08-15 13:40:41","posting":[{"id":298,"uuid":"7c560a95-8229-4a12-83f6-8e5e8195783a","author_user_id":8100,"materi_section_id":87,"judul":"Day 6 : Scrum Values, Roles, and Principles","permalink":"day-6-scrum-values-roles-and-principles","konten":"<p><!-- wp:paragraph --><\/p>\r\n<p>Sesuai dengan pengenalan pada pertemuan sebelumnya, materi scrum ini dibagi menjadi beberapa bagian yaitu sebagai berikut.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list {\"ordered\":true} --><\/p>\r\n<ol>\r\n<li>Scrum Team<\/li>\r\n<li>Scrum Value<\/li>\r\n<li>Scrum Principles<\/li>\r\n<li>Scrum Events<\/li>\r\n<li>Scrum Implementation<\/li>\r\n<li>Scrum in Product Management \/ Development<\/li>\r\n<\/ol>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Nah, di materi kali ini, kita akan berkenalan dengan tiga materi sekaligus, yaitu <strong>Scrum Team, Scrum Value, dan Scrum Principles.<\/strong><\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:heading --><\/p>\r\n<h2><strong>Scrum Team<\/strong><\/h2>\r\n<p><!-- \/wp:heading --> <!-- wp:paragraph --><\/p>\r\n<p>Sekarang, kita akan mengenal lebih dalam mengenai peran peran anggota tim dalam scrum. secara garis besar, scrum mengenal tiga jenis peran, yaitu <strong><em>Product Owner, Scrum Master, <\/em><\/strong><em>dan <strong>Development Team<\/strong><\/em>. Berikut merupakan penjelasan dari masing-masing jenis peran anggota yang ada dalam scrum.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:heading {\"level\":3} --><\/p>\r\n<h3>Product Owner<\/h3>\r\n<p><!-- \/wp:heading --> <!-- wp:paragraph --><\/p>\r\n<p>Product Owner, secara bahasa dapat ditranslasikan menjadi \"pemilik product\". Sesuai dengan nama tersebut, seorang product owner merupakan orang yang bertanggung jawab atas product yang ada. Seringkali, seorang Project \/ Product Manager masuk kedalam peran Product Owner dalam cara kerja scrum. Product owner merupakan jembatan antara tim scrum dengan pihak stakeholder. Product Owner juga merupakan peran yang menentukan apa yang akan di kembangkan dalam sebuah product. oleh karena itu, <strong><em>product owner merupakan peran yang memiliki kewajiban untuk mengatur product backlog<\/em><\/strong><em>. <\/em>Pengaturan disini meliputi menambahkan item baru, mengurangi, dan juga mengurutkan prioritas dari product backlog yang ada. Berikut merupakan aktivitas yang dilakukan oleh seorang product owner :<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li>Menuliskan Product Backlog dengan jelas<\/li>\r\n<li>Mengurutkan Product Backlog sesuai dengan tingkat prioritas berdasarkan value yang paling tinggi<\/li>\r\n<li>Mengoptimalkan value yang dari deliverables yang dikerjakan oleh tim development<\/li>\r\n<li>Memastikan bahwa product backlog terlihat, transparan, dan jelas untuk seluruh anggota tim<\/li>\r\n<li>Memastikan bahwa development team telah paham mengenai product backlog yang akan dikerjakan<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Adapun seorang Product Owner yang baik memiliki ciri ciri sebagai berikut.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li><strong>Empowered.<\/strong> Memiliki kemampuan membuat keputusan untuk produk<\/li>\r\n<li><strong>Business-savvy.<\/strong> Mengetahui produk dari sisi bisnis, customer, dan market<\/li>\r\n<li><strong>Persuasive.<\/strong> Dapat bekerja dengan baik dengan tim dan stakeholder<\/li>\r\n<li><strong>Knowledgeable.<\/strong> Mengetahui tantangan dari sisi market dan produk.<\/li>\r\n<li><strong>​Available<\/strong>: Selalu ada untuk dihubungi oleh team dan stakeholder<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>&nbsp;<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:heading {\"level\":3} --><\/p>\r\n<h3>Scrum Master<\/h3>\r\n<p><!-- \/wp:heading --> <!-- wp:paragraph --><\/p>\r\n<p>Scrum Master dalam cara kerja scrum ini berperan sebagai seorang fasilitator, yang memastikan bahwa nilai-nilai scrum dijalankan dengan baik oleh tim scrum. Umumnya, seorang Scrum Master pasti memiliki 1 tim yang secara individu dikelola. Namun, tidak menutup kemungkinan seorang Scrum Master ada di beberapa tim scrum. Tanggung jawab utama dari seorang scrum master ini adalah <strong>memastikan cara kerja scrum diimplementasi dengan baik oleh seluruh anggota tim.<\/strong> untuk dapat mencapai hal tersebut, seorang scrum master haruslah memahami dengan baik bagaimana cara kerja scrum dijalankan. Scrum Master umumnya juga menghadiri seluruh scrum event, dan menjadi fasilitator untuk beberapa event. Adapun berikut merupakan ciri ciri yang dimiliki oleh seorang Scrum Master.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li><strong>Humble. <\/strong>Memberikan penghargaan kepada tim, tidak diri sendiri<\/li>\r\n<li><strong>Respectful.<\/strong>Menghargai seluruh anggota tim scrum<\/li>\r\n<li><strong>Empathetic.<\/strong> Memahami anggota tim. Mampu menjadi seorang pendengar.<\/li>\r\n<li><strong>Persuasive.<\/strong> Berusaha untuk mengatasi halangan pada organisasi<\/li>\r\n<li><strong>Connected.<\/strong> Mengetahui siapa yang harus dihubungi untuk menyelesaikan permasalahan dalam tim.<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:heading {\"level\":3} --><\/p>\r\n<h3>Development Team<\/h3>\r\n<p><!-- \/wp:heading --> <!-- wp:paragraph --><\/p>\r\n<p>Development team, dalam manajemen proyek tradisional mirip dengan tim pelaksana proyek. tim pelaksana proyek ini biasanya terdiri dari multi disiplin ilmu yang dibutuhkan untuk penyelesaian sebuah proyek. sama halnya dengan scrum, development team juga biasanya terdiri dari beberapa orang dengan disiplin ilmu yang berbeda beda sesuai dengan domain knowledge yang dibutuhkan untuk menyelesaikan proyek tersebut. adapun development team dalam scrum memiliki ciri sebagai berikut :<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li><strong>Self Organized. <\/strong>Tim development dalam scrum pada dasarnya dapat bekerja secara otonom untuk menyelesaikan sprint backlog yang telah disepakati untuk dikerjakan.<\/li>\r\n<li><strong>Cross Functional<\/strong>. Tim terdiri dari berbagai domain knowledge berbeda yang diperlukan untuk menyelesaikan sebuah backlog<\/li>\r\n<li><strong>No Titles<\/strong>. walaupun memiliki pengetahuan masing-masing dan field yang berbeda, dalam scrum tidak dibedakan pekerjaannya, masih dalam satu lingkup developer.<\/li>\r\n<li><strong>No sub teams<\/strong>. Tidak ada tim kecil yang dibentuk dalam tim scrum untuk menjalankan sprint. satu scrum team, hanya boleh terdiri dari satu tim saja tanpa sub tim yang lebih kecil<\/li>\r\n<li><strong>Shared Accountability<\/strong>. Walaupun memiliki pekerjaan yang spesifik, namun penyelesaian dari backlog merupakan tanggung jawab dari seluruh development team<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:heading --><\/p>\r\n<h2>Scrum Values<\/h2>\r\n<p><!-- \/wp:heading --> <!-- wp:paragraph --><\/p>\r\n<p>Setelah mengetahui scrum team yang terdiri dari tiga bagian dengan masing-masing perannya yang spesifik, perlu juga untuk diketahui bahwa scrum memiliki nilai yang disebut <strong>scrum values<\/strong>. <strong>scrum values <\/strong>merupakan nilai yang harus dimiliki oleh setiap anggota tim scrum supaya scrum dapat dilaksanakan dengan baik. terdapat 5 nilai yang ada dalam scrum values, yaitu sebagai berikut.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list {\"ordered\":true} --><\/p>\r\n<ol>\r\n<li><strong>Courage <\/strong><br \/>Courage disini memiliki arti berani dalam menyampaikan suaranya. disini, masing-masing anggota dalam tim scrum harus dapat secara berani menyatakan tidak, secara berani meminta bantuan kepada anggota tim lain, serta berani juga untuk mencoba hal baru.<\/li>\r\n<li><strong>Focus <\/strong><br \/>Focus disini merupakan nilai yang penting. dalam scrum, focus yang dimaksud adalah fokus untuk menyelesaikan pekerjaan dalam satu sprint. sehingga, apapun yang dilaksanakan harus diselesaikan. hal ini juga yang membuat tim scrum tidak henti-hentinya untuk selalu membatasi pekerjaan dalam status work in progress.<\/li>\r\n<li><strong>Commitment <\/strong><br \/>Komitmen dalam Scrum sangat penting untuk membangun budaya agile. Dalam scrum, tim bekerja sama sebagai satu kesatuan. Ini berarti bahwa tim dalam scrum saling percaya untuk benar benar melakukan yang disepakati. sehingga dalam scrum, tim development dapat mengambil tugas dengan bebas, tergantung dari kesanggupan komitmen dari tim scrum tersebut.<\/li>\r\n<li><strong>Respect<\/strong><br \/>Respect dalam hal ini berlaku pada seluruh pihak, baik development team, product owner, dan scrum master. tim scrum yang baik mampu untuk tetap menghargai sesama anggota timnya, dengan mengetahui kontribusi masing-masing, memberikan apresiasi terhadap pekerjaan, atau bahkan memaklumi kesalahan dari anggota tim sesekali.<\/li>\r\n<li><strong>Openness<\/strong><br \/>Openness disini merupakan nilai dimana seluruh pekerjaan dan tantangan yang dialami dapat terlihat dalam scrum. apabila seorang tim mengalami suatu kendala, maka ia didorong untuk menceritakan dan terbuka kepada tim supaya dapat saling membantu. karena pada akhirnya, penyelesaian backlog dalam scrum merupakan tanggung jawab bersama.<\/li>\r\n<\/ol>\r\n<p><!-- \/wp:list --> <!-- wp:heading --><\/p>\r\n<h2>Scrum Principle<\/h2>\r\n<p><!-- \/wp:heading --> <!-- wp:paragraph --><\/p>\r\n<p>Setelah sebelumnya kita mengenal peran dalam scrum, serta nilai nilai yang ada, kali ini kita akan sedikit membahas prinsip dalam scrum. Sebelum masuk ke prinsip dalam scrum, mungkin ada baiknya kita tahu dulu gambaran umum dari kerangka kerja scrum ini. Flow untuk kerangka kerja scrum secara umum dikutip dari Scrum Body of Knowledge adalah sebagai berikut.&nbsp;<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:image --><\/p>\r\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh5.googleusercontent.com\/9fokDn3VEZ-J3tWT3UYh1rUbNBAA8b0aHlo8aun3VrSfFYINvsZHfRdIxFdKd04iX6n7UcgriK0uhQlXTdqY3v7fv3_0_i860-XV8Zw_UXPyeRxav0GPtWYDiuQYbxqN28GlOS4\" alt=\"A close up of a device\r\n\r\nDescription automatically generated\" \/><\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:paragraph --><\/p>\r\n<p>Nah, kalau diliat2 secara umum, pada dasarnya hal ini gak berbeda jauh dengan manajemen proyek pada umumnya. Di tahap awal, tetap selalu ada <strong>project business case<\/strong> yang membahasa mengenai problem dan solusi dari sebuah permasalahan bisnis. Hal ini kemudian di translasikan menajdi sebuah <strong>project vision \/ product vision<\/strong>. Nah karena di kelas agile development ini fokus kita adalah kepada metode scrumnya dan bukan ke bagian management proyeknya, part project business case dan pengembangan project vision tidak akan kita bahas secara teknikal.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Kita akan berfokus pada bagian setelah project\/product Vision telah selesai dibuat. Setelah product vision selesai dibuat, secara umum kemudian disusunlah kebutuhan dari user dengan menggunakan model <strong>prioritized product backlog.<\/strong> Dari product backlog tersebut, kemudian juga dapat disusun rencana launch dari product tersebut. Nah, setelahnya, barulah manajemen scrum mulai terlihat berbeda dengan yang lain. Product backlog, diambil secara perlahan lahan untuk dipindahkan ke sprint backlog, untuk kemudian diselesaikan oleh tim proyek secara iterative,hingga menghasilkan sebuah produk.&nbsp;<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Nah setelah tau garis besar scrum, yuk kita lanjut ke bahasan scrum principles.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:image --><\/p>\r\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh5.googleusercontent.com\/wYcJsYzmNKyursYtr5xgue4-yN6eD_f58TvbmKo_EHGrm51DTgCBjVNvqKV190KBkuseRtB-OnD4-1FfID07fdcDhmjLJpHMGsI95EEwMgd17cor9WjXqqhLCzsLscaQl4Cxm0Y\" alt=\"A picture containing clock\r\n\r\nDescription automatically generated\" \/><\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:paragraph --><\/p>\r\n<p>Gambar ini merupakan rangkuman dari prinsip yang ada dalam scrum.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Teman teman pasti udah paham lah ya dengan istilah prinsip. Bahasa sederhananya, prinsip merupakan hal yang harus ada, merupakan fondasi, dan tidak boleh hilang. Jadi, dalam scrum ini, ada prinsip prinsip yang harus dipegang teguh juga. Dimana ketika prinsip ini dilanggar, kita berarti belum menerapkan Scrum. Jadi prinsip ini sifatnya <strong>tidak dapat dinegosiasikan<\/strong>, dan harus diimplementasikan secara menyeluruh. Nah, untuk prinsip yang harus ada dalam scrum ini, terdapat 6 prinsip yaitu sebagai berikut.&nbsp;<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li><strong>Empricial Process Control<br \/><\/strong>Empirical Process Control ( Pengaturan Proses secara Empirik ) merupakan salah satu aspek dalam scrum yang terdiri dari tiga ide utama, yaitu <strong>transparansi, inspeksi, dan adaptasi.&nbsp;<\/strong>\r\n<ul>\r\n<li>Transparansi <br \/>Transparansi dalam scrum memungkinkan segala proses untuk dapat dilihat oleh semua orang. Berikut merupakan gambaran dari Transparansi dalam scrum.<\/li>\r\n<li>Adaptasi <br \/>Scrum merupakan turunan dari agile, yang berarti scrum&nbsp; juga merupakan kerangka kerja yang bersifat adaptif. Adaptif di scrum diwujudkan dalam beberapa hal sebagai berikut.<\/li>\r\n<li>Inspeksi<br \/>Dalam scrum, masing masing tim dapat melihat pekerjaann antar anggota dan saling berkolaborasi dalam melalui beberapa hal berikut.<\/li>\r\n<\/ul>\r\n<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:image --><\/p>\r\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh4.googleusercontent.com\/Y5dqJBspvEgQYelmbrKO_M49j6EE5NE9Sv8IBINofsBDVQguyflTgrAqoy5OH3O3ACjozfEB-qYQJhulH5LrARnYQnOruhpecHSJAoranJZfLfqs9BWCUR7_R-QgUGZFTYNIsqE\" alt=\"A screenshot of a cell phone\r\n\r\nDescription automatically generated\" \/>\r\n<figcaption>Transparansi Scrum<\/figcaption>\r\n<\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:image --><\/p>\r\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh5.googleusercontent.com\/zTzaNqXUhfuddNqKYehR3jhROQH3vVi7Iqh-xIh59AUVlTR4TwvVDBTcbdG1-BMZroa5bDDkATdf3gISsHzKyYNjKriMG5V6CuWAR2uTXBLQhuc-GJzK_srGq-oQpwfo80qW_Jc\" alt=\"A close up of text on a white background\r\n\r\nDescription automatically generated\" \/>\r\n<figcaption>Scrum Adaptation<\/figcaption>\r\n<\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:image --><\/p>\r\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh5.googleusercontent.com\/_r0HBjBeA27S_KAK2zGNzNpWwJlisJclULbr2IWRDfGaZbAatUwyzeBhI4htIjIZ9P-Zx5efXGUpqf6pU7QULLjWtd-iINcsLverZIBjh-ij7lWv8ADYLZED2o9SNmpF4Kxg5sI\" alt=\"A screenshot of a social media post\r\n\r\nDescription automatically generated\" \/>\r\n<figcaption>Scrum Inspection<\/figcaption>\r\n<\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li><strong>Self Organization <\/strong><br \/>Scrum menganut teori Y dalam manajemen menurut McGregor, dimana karyawan bersifat <strong><em>Self Motivated <\/em><\/strong>dan berusaha untuk terus berkembang. Jadi, akan jauh lebih baik ketika karyawan tidak diatur (self managed).&nbsp; Adapun beberapa keuntungan dari self organization ini adalah sebagai berikut.<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:list {\"ordered\":true} --><\/p>\r\n<ol>\r\n<li>Team buy in &amp; Shared Ownership<\/li>\r\n<li>Motivation&nbsp;<\/li>\r\n<li>Innovative and creative environment for growth<\/li>\r\n<\/ol>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Adapun berikut merupakan hal yang menjadi tujuan ketika tim diarahkan untuk menjadi bersifat <strong><em>self organized.<\/em><\/strong><\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:image --><\/p>\r\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh3.googleusercontent.com\/bpo6lQqEwcA5GGomlcMmAtsVf3K41WHZ4u6MOSapbTbT1XCQV1g1oZNtZVUkboLCtOfBWt5yuAwqEOboNVYSrca6K19vKqtZg1HvW4JOvY0bzfEXUNcmvpV6GgvUTKWttTpODZs\" alt=\"A close up of a logo\r\n\r\nDescription automatically generated\" \/><\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:paragraph --><\/p>\r\n<p>&nbsp;<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li><strong>Collaboration<br \/><\/strong>Dalam scrum, kolaborasi merupakan hal yang sangat ditekankan. dalam hal ini, kolaborasi yang dilakukan berbeda dengan sekedar bekerja sama. Kolaborasi disini berarti tidak sekedar &ldquo;bekerja bersama&rdquo; akan tetapi menerima input dari pihak lain dan menjadikan hal tersebut sebagai masukan untuk dapat menyelesaiakan produk \/ projek dengan lebih baik.&nbsp;<\/li>\r\n<li><strong>Value Based Prioritization <br \/><\/strong>Aspek penting berikutnya dalam scrum adalah mengenai prioritisasi. scrum memiliki konsep untuk memprioritaskan hal yang memiliki <strong><em>business value <\/em><\/strong>yang paling tinggi. Adapun perbedaannya dengan manajemen proyek tradisional adalah sebagai berikut<br \/><br \/><\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:image --><\/p>\r\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh5.googleusercontent.com\/zDOqiHj9yCZ-2tZKbIWLh7AAj_0t4RT2T22Buskrka6FQKuRlq7upRQ0mTtQHwXHlb5WNTXhdA3hRxh9hnvsDOhoegHHtIQ7Y5oUfG2mgKXhxT1f3e0oKL1U1dc1cg\" alt=\"\" \/><\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:paragraph --><\/p>\r\n<p>Value yang paling tinggi ini dicerminkan dalam <strong>product backlog <\/strong>yang selalu terurut berdasarkan prioritas yang paling tinggi. <strong>Product Backlog <\/strong>ini, berisi user stories yang dapat memuat beberapa hal seperti berikut.&nbsp;<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:image --><\/p>\r\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh5.googleusercontent.com\/mzYyQDlzMkyfsel4TokxRg0DidXmXGCpiLA7K_fUChQmjBo0nHxFfWTVfhFWUAPr7kL8pJXTeFrdyvweuPCsXmwD0m6N-KfIha1YveeIqaxmJBJlTplYh1Q4ZsFrnGowjD2F0Do\" alt=\"A picture containing clock\r\n\r\nDescription automatically generated\" \/><\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li><strong>Time Boxing&nbsp;<\/strong><\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:image --><\/p>\r\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh6.googleusercontent.com\/nA9B_ltTbM6_1Ew7fvL5lEn1WoHwu11Bc86PplsNgmrvdpoXoFT85tqQObxykWJrzvKRsZiZQoDO3_bchkbbyecaIqqyfIkwG2zlnNmXvWbn-7KPSaUEGdg3HgZH2rPzXvOVX8c\" alt=\"A close up of a logo\r\n\r\nDescription automatically generated\" \/><\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:paragraph --><\/p>\r\n<p>Dalam scrum, setiap kegiatan yang ada telah diatur dan harus memiliki batasan waktu tersendiri. Pembatasan waktu ini dilakukan untuk membantu memanage proyek dengan lebih efektif. masing masing kegiatan dalam scrum memiliki batasan waktu sebagai berikut.<strong><br \/><\/strong><\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li><strong>Iterative Development<\/strong><\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Dalam scrum , kegiatan pengembangan tidak dilakukan dalam satu kali pengembangan, akan tetapi dibuat menjadi iteratif dengan beberapa kali iterasi. hal ini ditujukan untuk mengakomodasi perubahan dan tetap memberikan nilai business value yang tinggi kepada customer. berikut merupakan contoh ilustrasi dari pengembangan iterative dibandingkan dengan tradisional waterfall.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:image {\"id\":4440,\"width\":248,\"height\":337,\"sizeSlug\":\"large\"} --><\/p>\r\n<figure class=\"wp-block-image size-large is-resized\"><img class=\"wp-image-4440\" src=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/image-31.png\" alt=\"\" width=\"248\" height=\"337\" \/><\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:paragraph --><\/p>\r\n<p>Oke teman teman, sekian dulu materi untuk hari ini. tugas dan materi ppt dapat diakses disini ya : <br \/>\/<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:file {\"id\":9902,\"href\":\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Materi-Agile-Day-6.pdf\"} --><\/p>\r\n<div class=\"wp-block-file\"><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Materi-Agile-Day-6.pdf\">Materi-Agile-Day-6<\/a><a class=\"wp-block-file__button\" href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Materi-Agile-Day-6.pdf\" download=\"\">Unduh<\/a><\/div>\r\n<p><!-- \/wp:file --> <!-- wp:file {\"id\":9905,\"href\":\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Soal-Tugas-Day-6.docx\"} --><\/p>\r\n<div class=\"wp-block-file\"><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Soal-Tugas-Day-6.docx\">Soal-Tugas-Day-6<\/a><a class=\"wp-block-file__button\" href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/08\/Soal-Tugas-Day-6.docx\" download=\"\">Unduh<\/a><\/div>\r\n<p><!-- \/wp:file --><\/p>","waktu_publish":"2021-11-01 08:00:00","status_publish":"publish","urutan":1,"created_by":8100,"updated_by":8100,"created_at":"2020-12-08 21:01:46","updated_at":"2021-10-24 11:23:26","waktu_publish_formatted":" Senin, 01 November 2021. 08:00:00 WIB."}]},{"id":94,"uuid":"dface44c-ba7b-4075-bdff-4d9f82a1e0ec","materi_id":6,"nama":"Day 7","permalink":"day-7","urutan":7,"created_by":8100,"updated_by":8100,"created_at":"2020-12-08 20:37:50","updated_at":"2021-04-25 10:41:39","posting":[{"id":299,"uuid":"772c72f1-bc45-472b-96ba-b233c38df7c1","author_user_id":8100,"materi_section_id":94,"judul":"Day 7 : Scrum Events : Part 1","permalink":"day-7-scrum-events-part-1","konten":"<p><!-- wp:paragraph --><\/p>\r\n<p>Pada sesi ini lanjut materi Scrum Events. Sebelumnya kita telah mempelajari mengenai Scrum Team, Scrum Values, dan Scrum Principles. Ketiga hal tersebut akan kita jadikan landasan dalam mempelajari materi hari ini, yaitu scrum Events.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Seperti yang telah kita tahu, Proses Scrum Project memiliki gambaran sebagai berikut.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:image {\"id\":4473,\"sizeSlug\":\"large\"} --><\/p>\r\n<figure class=\"wp-block-image size-large\"><img class=\"wp-image-4473\" src=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/Screen-Shot-2020-06-24-at-08.52.39-1024x425.png\" alt=\"\" \/><\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:paragraph --><\/p>\r\n<p>Dalam Scrum Body of Knowledge, dijelaskan lebih detail mengenai proses proses apa saja yang ada dalam scrum. Dalam scrum, sebenarnya terdapat proses yang cukup banyak, yaitu terdapat 19 proses. 19 proses tersebut dapat kita pecah menjadi 5 fase, yaitu Inisiasi, Perencanaan,&nbsp; Implementasi, Evaluasi (Review &amp; Retrospect) , dan Release.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:image {\"id\":4675,\"sizeSlug\":\"large\"} --><\/p>\r\n<figure class=\"wp-block-image size-large\"><img class=\"wp-image-4675\" src=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/Screen-Shot-2020-06-27-at-10.51.36-1024x848.png\" alt=\"\" \/><\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:paragraph --><\/p>\r\n<p>19 proses yang ada disini mengacu kepada teori secara fundamental, yang dalam implementasinya pada dasarnya dapat disimplifikasi menjadi beberapa proses utama, yaitu :<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li>Inisiasi Scrum<\/li>\r\n<li>Sprint Planning<\/li>\r\n<li>Daily Standup<\/li>\r\n<li>Sprint Review<\/li>\r\n<li>Sprint Retrospective<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Sehingga, dalam materi kali ini, diagram yang akan digunakan sebagai bahan pembelajaran adalah sebagai berikut.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:image {\"id\":4475,\"sizeSlug\":\"large\"} --><\/p>\r\n<figure class=\"wp-block-image size-large\"><img class=\"wp-image-4475\" src=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/image-33.png\" alt=\"\" \/><\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:paragraph --><\/p>\r\n<p>Pada materi agile development 8 ini, kita akan membahas 2 proses utama, yaitu Initiate Scrum dan Sprint Planning. Berikut Merupakan penjelasan dari masing-masing proses tersebut.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list {\"ordered\":true} --><\/p>\r\n<ol>\r\n<li><strong>Initiate<\/strong><\/li>\r\n<\/ol>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Seperti Namanya, yaitu inisiasi, merupakan fase awal dalam pengembangan produk atau pelaksanaan project menggunakan kerangka kerja scrum. Nah disini, kita harus tau terlebih dahulu bahwa initiate ini merupakan proses awal sebelum iterasi dilakukan. Kita tahu, bahwa untuk memulai iterasi, kita diwajibkan untuk memiliki <strong>product backlog<\/strong> terlebih dahulu. Untuk membuat product backlog, kita harus tahu terlebih dahulu product apa yang sebenarnya kita ingin buat. Dalam project hal ini bisa berarti tujuan akhir project pada gambaran awal. Hal ini didapatkan dari proses meeting antara <strong>stakeholder &amp; product owner<\/strong>. Pada tahap ini, role yang paling penting untuk ada sebenarnya adalah <strong>product owner<\/strong>, karena product owner lah yang akan membuat product backlog nantinya. Apabila dituliskan, berikut merupakan langkah langkah yang harus dilakukan oleh seorang product owner pada tahap inisiasi.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list {\"ordered\":true} --><\/p>\r\n<ol>\r\n<li>Mengumpulkan kebutuhan mengenai produk yang akan dibuat (meeting dengan stakeholder)<\/li>\r\n<li>Membuat tim (Scrum Master dan Development Team)<\/li>\r\n<li>Membuat Product \/ Project Vision<\/li>\r\n<li>Membuat Epic \/ User Story<\/li>\r\n<li>Menentukan Prioritas<\/li>\r\n<\/ol>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Pada tahapan mengumpulkan kebutuhan mengenai produk, hal ini merupakan tahapan yang mirip dengan mengumpulkan kebutuhan dalam projek. Pada proses ini, product owner menggali kebutuhan dari customer nya\/ client, kemudian mengajak stakeholder yang terkait untuk ikut berdiskusi dalam menentukan apa yang sebenarnya dibutuhkan dari sisi bisnis. Hal ini dilakukan <strong>product owner<\/strong> dengan cara komunikasi, menggali data, membuat sebuah inisiatif, sehingga dihasilkan sebuah ide untuk menyelesaikan kebutuhan bisnis tersebut melalui pengembangan suatu produk \/ deliverables (dalam project). Setelah <strong>Product Owner <\/strong>memiliki kejelasan mengenai produk apa yang harus dibuat, maka langkah berikutnya adalah membentuk tim. Disinilah mulai ada keterlibatan <strong>Scrum Master <\/strong>&amp; <strong>Development Team<\/strong>.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Ketika tim sudah terbentuk, kemudian <strong>Product Owner, Scrum Master, &amp; Development Team <\/strong>dapat masuk ke langkah berikutnya, yaitu melakukan pembuatan product vision. Product vision ini penting untuk dibuat diawal, karena product Vision inilah yang menjadi landasan mengapa sebuah produk dikembangkan. Untuk membuat product vision, terdapat banyak sekali template yang dapat digunakan. Berikut merupakan contoh sederhana dari templat <strong>Product Vision. <\/strong><\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:image --><\/p>\r\n<figure class=\"wp-block-image\"><img src=\"https:\/\/scrumorg-website-prod.s3.amazonaws.com\/drupal\/inline-images\/1%2Ay9kx2b5ANvSGQjo2mRKOTg.png\" alt=\"Vision Statement Template\" \/><\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:paragraph --><\/p>\r\n<p>Hal yang menjadi penting disini adalah penjelasan mengenai kebutuhan pada bagian <strong>For <\/strong>dan <strong>Who.<\/strong> Dua hal ini yang menjadi landasan utama dari product vision karena hal ini menyatakan siapa yang akan menggunakan product ini \/ deliverables dari project, dan untuk apa produk tersebut dibuat. Hal berikutnya yang penting adalah pada bagian <strong>key benefit dan reason<\/strong>, walaupun hal ini pada dasarnya diturunkan dari alasan kebutuhan di bagian sebelumnya, namun mendetilkan bagian ini akan dapat memberikan gambaran yang lebih baik dimasa yang akan datang. Dalam proses pembuatan product vision ini, product owner dapat mengundang tim scrum dari awal untuk ikut membantu dengan menyelenggarakan <strong><em>Product Vision Meeting<\/em><\/strong>, atau melaksanakan pembuatan product vision terlebih dahulu tanpa tim.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Setelah mengisi template dari product vision tadi, tahapan berikutnya adalah <strong>product owner <\/strong>membuat daftar user story dari product vision yang telah dibuat. Ada yang mengatakan sebenarnya yang dibuat pertama kali adalah epic, karna <strong>product owner<\/strong> belum tahu seberapa besar bobot dari pekerjaannya, atau belum bisa memecah menjadi detail yang bisa dikerjakan dalam satu sprint. Disinilah peran development team hadir untuk membantu product owner. <strong>Development team<\/strong> dapat membantu <strong>product owner<\/strong> untuk membuat story story yang ada. Berbicara tentang epic dan user story, sebenarnya itu benda apasih ? Kalau dari penjelasan sebelumnya, product backlog itu isinya adalah user story, dan product backlog secara umum berisi penjelasan mengenai kebutuhan dari target user. Sehingga sebenarnya user story itu adalah <strong>daftar kebutuhan (requirement) dari target user. <\/strong><\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Trus kalau epic apa?<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Sebenarnya, epic itu adalah sesederhana user story, yang masih sangat besar sehingga tidak dapat dikembangkan dalam satu kali iterasi. Oleh karena itu, biasanya dalam fase inisiasi, seorang product owner seringkali dikatakan bukan membuat user story tapi masih dalam proses membuat epic. Untuk lebih dapat gambarannya, berikut merupakan hirarki dari user story.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:image --><\/p>\r\n<figure class=\"wp-block-image\"><img src=\"https:\/\/wac-cdn.atlassian.com\/dam\/jcr:c79bf6d8-3101-48c3-bf2b-506b5bc53ccc\/Themes.png?cdnVersion=1093\" alt=\"Agile epics vs stories vs themes | Atlassian Agile Coach\" \/><\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:paragraph --><\/p>\r\n<p>Nah, ada istilah baru lagi tuh, <strong>initiative sama theme. <\/strong>Apalagi tuh ? Sederhananya, inisiatif merupakan ide kita tentang product yang ingin dikembangkan. Bisa berasal dari product vision, atau turunan dari product vision. Nah kalau tema, sebenarnya sesederhana melabeli dari inisiatif itu, sebenarnya masuk kategori apasih. Sebagai contoh, kita bisa punya tema berupa B2B, B2C, kemudian inisiatif platform jual beli, aplikasi belanja online, dan aplikasi penjualan online dimana platform jual beli kita beri tema B2B dan B2C, aplikasi belanja online B2C, dan aplikasi penjualan online B2B.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>nah kemudian epic nya apanih ?<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>epic nya bisa fitur cekout, fitur tanya jawab, fitur cari produk, fitur cari toko, dan segala macamnya. Untuk story, akan lebih detail lagi biasanya. Missal untuk fitur cekout, dapat dibuat beberapa story berikut.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list {\"ordered\":true} --><\/p>\r\n<ol>\r\n<li>Sebagai pembeli, saya ingin memilih kurir yang digunakan, supaya bisa pilih opsi yang ada di kota saya<\/li>\r\n<li>Sebagai pembeli, saya ingin membayar menggunakan kartu kredit,supaya tidak repot harus ke indomaret.<\/li>\r\n<li>Dan lainnya.<\/li>\r\n<\/ol>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Oke itu kan contoh user story nya. Nah buat bikin user story, ada beberapa hal nih yang harus diperhatiin.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li>Siapa yang jadi usernya. Cari tahu sedetail mungkin user kita itu siapa, kalau bisa sampe karakteristik usernya. (Biasanya pakai user persona)<\/li>\r\n<li>Apa yang jadi keinginan user. Cari tau sebenarnya apa sih yang mereka ingin lakuin. Dalam produk misal,<\/li>\r\n<li>Apa tujuan dari user<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Nah setelah user story ini jadi seluruhnya, tugas product owner belum selesai nih. product owner masih harus menyelesaikan satu tahap lagi yaitu prioritisasi dari backlog tersebut. Jadi, idenya adalah product backlog paling atas selalu merupakan product backlog paling penting, dan harus dikerjakan dari awal. Untuk metode prioritisasi, tidak akan dijelaskan disini. Tapi untuk referensi teman-teman dapat mengunjungi referensi yang saya lampirkan pada akhir artikel ini. Setelah product backlog terurut, kita baru dapat masuk ke tahapan berikutnya, yaitu sprint planning.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li><strong>Sprint Planning<\/strong><\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Nah, sekarang kita masuk ke sprint planning. Dalam sprint planning, agenda yang harus dilakukan pada dasarnya adalah sebagai berikut.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list {\"ordered\":true} --><\/p>\r\n<ol>\r\n<li>Product Owner melakukan presentasi apa yang ada pada product backlog kepada Development team, memastikan development team paham mengenai apa yang akan dibuat.<\/li>\r\n<li>Development team melihat user story yang dibuat oleh Product Owner, apakah masih terlalu besar dan butuh di perdetil atau sudah cukup jelas.<\/li>\r\n<li>Apabila perlu diperdetil, lakukan diskusi pada meeting ini dengan memberikan penjabaran detil yang perlu dibuat.<\/li>\r\n<li>Apabila sudah dirasa cukup detil, maka user story dapat dipindahkan dari product backlog menuju sprint backlog. Ingat, disini mengambil product backlog ke sprint backlog harus dilakukan dari backlog yang paling atas.<\/li>\r\n<li>Setelah menentukan product backlog, tim development dapat menjabarkan task yang diperlukan untuk menyelesaikan user story tersebut.<\/li>\r\n<li>Setelah menjabarkan task&nbsp; yang ditentukan, langkah berikutnya adalah menentukan bobot untuk setiap task tersebut.<\/li>\r\n<li>Ketika sudah selesai pembobotan task, maka meeting dapat dikatakan selesai dan sprint dapat dimulai.<\/li>\r\n<\/ol>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Nah, sederhana kan sebenarnya perencanaan dalam scrum ? kenapa sesederhana memindahkan product backlog saja ke sprint backlog ? karena dalam kerangka kerja scrum beberapa hal telah menjadi pekerjaan yang dilakukan sebelumnya oleh product owner, dan ketika melakukan planning, product owner memberikan presentasi mengenai product backlog yang ada. Disini, product owner wajib mengkomunikasikan apa yang dimaksud dalam masing masing <strong><em>product backlog item<\/em><\/strong>(PBI) yang ada.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Masih bingung ? Terakhir nih, ada video yang bisa bikin kamu lebih paham soal sprint planning.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:core-embed\/youtube {\"url\":\"https:\/\/www.youtube.com\/watch?v=wPvG9NZNUa4\",\"type\":\"video\",\"providerNameSlug\":\"youtube\",\"className\":\"wp-embed-aspect-4-3 wp-has-aspect-ratio\"} --><\/p>\r\n<figure class=\"wp-block-embed-youtube wp-block-embed is-type-video is-provider-youtube wp-embed-aspect-4-3 wp-has-aspect-ratio\">\r\n<div class=\"wp-block-embed__wrapper\"><iframe src=\"\/\/www.youtube.com\/embed\/wPvG9NZNUa4\" width=\"560\" height=\"314\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/div>\r\n<\/figure>\r\n<p><!-- \/wp:core-embed\/youtube --> <!-- wp:paragraph --><\/p>\r\n<p>Sumber tambahan : Metode Prioritisasi : <a href=\"https:\/\/foldingburritos.com\/product-prioritization-techniques\/\">https:\/\/foldingburritos.com\/product-prioritization-techniques\/<\/a><\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:file {\"id\":10002,\"href\":\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/Materi-Day-7.pdf\"} --><\/p>\r\n<div class=\"wp-block-file\"><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/Materi-Day-7.pdf\">Materi-Day-7<\/a><a class=\"wp-block-file__button\" href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/Materi-Day-7.pdf\" download=\"\">Unduh<\/a><\/div>\r\n<p><!-- \/wp:file --> <!-- wp:file {\"id\":10036,\"href\":\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/Soal-Tugas-Day-7-1.docx\"} --><\/p>\r\n<div class=\"wp-block-file\"><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/Soal-Tugas-Day-7-1.docx\">Soal-Tugas-Day-7<\/a><a class=\"wp-block-file__button\" href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/Soal-Tugas-Day-7-1.docx\" download=\"\">Unduh<\/a><\/div>\r\n<p><!-- \/wp:file --><\/p>","waktu_publish":"2021-11-02 08:00:00","status_publish":"publish","urutan":1,"created_by":8100,"updated_by":8100,"created_at":"2020-12-08 21:03:13","updated_at":"2021-10-24 11:23:38","waktu_publish_formatted":" Selasa, 02 November 2021. 08:00:00 WIB."}]},{"id":89,"uuid":"5c967b38-69ed-496d-bb9a-79a968a333a2","materi_id":6,"nama":"Day 8","permalink":"day-8","urutan":8,"created_by":8100,"updated_by":8100,"created_at":"2020-12-07 10:44:59","updated_at":"2021-04-25 10:41:39","posting":[{"id":300,"uuid":"29acbe11-ac10-4df9-87a4-db85ce2e961b","author_user_id":8100,"materi_section_id":89,"judul":"Day 8 : Scrum Events : Part 2","permalink":"day-8-scrum-events-part-2","konten":"<p><!-- wp:paragraph --><\/p>\r\n<p>Pada materi sebelumnya, kita telah mempelajari mengenai <strong>Sprint Planning, <\/strong>dengan hasil akhir bahwa <strong>Sprint <\/strong>sudah dapat dimulai dan dijalankan. Pada hari ini, kita akan membahas tentang eksekusi Sprint itu sendiri. Terdapat beberapa proses yang harus diperhatikan yaitu <strong>Daily Scrum, Sprint Review &amp; Retrospective.<\/strong> Dalam scrum sprint, juga sebenarnya boleh diadakan meeting untuk membantu <strong><em>Product Owner <\/em><\/strong>dalam mendetailkan backlog, yang disebut Degnan backlog grooming, namun meeting ini akan kita bahas pada materi berikutnya, yaitu hal hal yang bersifat opsional dalam Scrum.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:heading --><\/p>\r\n<h2><strong>Daily Standup \/ Scrum<\/strong><\/h2>\r\n<p><!-- \/wp:heading --> <!-- wp:group --><\/p>\r\n<div class=\"wp-block-group\">\r\n<div class=\"wp-block-group__inner-container\">&nbsp;<\/div>\r\n<\/div>\r\n<p><!-- \/wp:group --> <!-- wp:paragraph --><\/p>\r\n<p>Daily Standup \/ Scrum merupakan meeting harian dalam scrum, yang dibatasi secara waktu yaitu <strong>15 menit pada setiap harinya.<\/strong> Daily Standup ini merupakan meeting yang wajib dihadiri oleh seluruh <strong>Development team<\/strong>, dan juga <strong>Scrum Master<\/strong>. <strong>Product Owner <\/strong>tidak wajib menghadiri meeting ini karena Product Owner tidak memiliki kewajiban untuk melakukan <strong>micro manage <\/strong>dari tim. Tim diasumsukan dapat bertanggung jawab dengan pekerjaan yang telah diambil untuk sprint pada tahapan sprint planning. Akan tetapi, <strong>Product Owner <\/strong>boleh untuk menghadiri Daily Standup ini untuk mengetahui kondisi pengembangan produk yang sedang berjalan.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p><br \/>Berikut merupakan ketentuan dari Daily Standup.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li>Hanya sebagai tempat untuk melaporkan progress<\/li>\r\n<li>tidak terdapat diskusi terhadap laporan yang disampaikan oleh masing masing anggota tim development, apabila membutuhkan diskusi, dapat dilakukan diluar kegiatan daily standup<\/li>\r\n<li>hanya berlangsung singkat, tidak boleh lebih dari 15 menit setiap harinya<\/li>\r\n<li>Menyampaikan beberapa informasi berikut\r\n<ul>\r\n<li>Apa yang sudah dikerjakan<\/li>\r\n<li>Apa yang akan dikerjakan hari ini<\/li>\r\n<li>Tantangan apa yang sedang dihadapi (blocker)<\/li>\r\n<\/ul>\r\n<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Ketika daily standup terdapat tantangan, scrum master harus berusaha untuk membantu tim development untuk menghadapi blocker tersebut. Kemudian, sesuai dengan scrum principles, Tim harus memiliki kepedulian terhaddap sesama karena goal dari sprint hanya dapat dicapai bersama.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:core-embed\/youtube {\"url\":\"https:\/\/youtu.be\/er9gntPjTJU\",\"type\":\"video\",\"providerNameSlug\":\"youtube\",\"className\":\"wp-embed-aspect-16-9 wp-has-aspect-ratio\"} --><\/p>\r\n<figure class=\"wp-block-embed-youtube wp-block-embed is-type-video is-provider-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\">\r\n<div class=\"wp-block-embed__wrapper\"><iframe src=\"\/\/www.youtube.com\/embed\/er9gntPjTJU\" width=\"560\" height=\"314\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/div>\r\n<\/figure>\r\n<p><!-- \/wp:core-embed\/youtube --> <!-- wp:heading --><\/p>\r\n<h2>Product Backlog Refinement<\/h2>\r\n<p><!-- \/wp:heading --> <!-- wp:paragraph --><\/p>\r\n<p>Pada saat sprint berjalan, terdapat sebuah meeting yang dapat dilakukan oleh tim scrum untuk meninjau ulang product backlog dan memecah user story menjadi lebih kecil. selain itu pada backlog refinement meeting ini juga kita dapat menghapus story apabila memang sudah tidak digunakan. berikut merupakan aktivitas yang dilakukan pada saat backlog refinement.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li>membuang user stories yang tidak relevan<\/li>\r\n<li>membuat user story baru sesuai kebutuhan<\/li>\r\n<li>meninjau ulang prioritisasi dari backlog<\/li>\r\n<li>memperbaiki\/memberikan estimasi kepada user story<\/li>\r\n<li>memecah user story yang besar menjadi lebih detail<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:heading --><\/p>\r\n<h2><strong>Sprint Review <\/strong><\/h2>\r\n<p><!-- \/wp:heading --> <!-- wp:paragraph --><\/p>\r\n<p>Sprint review merupakan aktivitas dalam scrum yang dilakukan pada akhir dari satu sprint. Sprint merupakan <strong>wadah<\/strong> bagi tim development untuk <strong>menunjukkan pekerjaan<\/strong> yang telah dilakukan selama satu sprint. Fokus dari Sprint Review adalah pada pekerjaan yang dilakukan selama sprint yang berkaitan dengan tujuan dari sprint dan user story yang dikerjakan selama sprint berlangsung.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>terdapat beberapa aktivitas yang dilakukan dalam sprint review, yaitu sebagai berikut<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li>Review hal yang selesai dan tidak selesai<\/li>\r\n<li>Melakukan demo produk yang dikembangkan<\/li>\r\n<li>Meninjau metrics dari pengembangan produk<\/li>\r\n<li>Meninjau dan merevisi product backlog<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:core-embed\/youtube {\"url\":\"https:\/\/youtu.be\/InXAS_zRvqQ\",\"type\":\"video\",\"providerNameSlug\":\"youtube\",\"className\":\"wp-embed-aspect-16-9 wp-has-aspect-ratio\"} --><\/p>\r\n<figure class=\"wp-block-embed-youtube wp-block-embed is-type-video is-provider-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\">\r\n<div class=\"wp-block-embed__wrapper\">https:\/\/youtu.be\/InXAS_zRvqQ<\/div>\r\n<\/figure>\r\n<p><!-- \/wp:core-embed\/youtube --> <!-- wp:heading --><\/p>\r\n<h2><strong>Sprint Retrospective <\/strong><\/h2>\r\n<p><!-- \/wp:heading --> <!-- wp:paragraph --><\/p>\r\n<p>Sprint retrospective merupakan aktivitas yang merupakan evaluasi terhadap <strong>cara kerja tim<\/strong>. hal ini ditujukan untuk meningkatkan efektivitas kerja dalam satu tim, mengidentifikasi hal hal yang dapat ditingkatkan seperti kolaborasi dan komunikasi, kapan waktu yang tepat untuk diskusi, bagaimana agar mencapai produktivitas yang tinggi, dan lainnya. output dari retrospective ini adalah daftar2 dari hal yang harus ditingkatkan, apa yang menjadi evaluasi, dan apa yang harus diimplementasi di sprint berikutnya dalam ruang lingkup <strong>cara kerja<\/strong>.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Berikut merupakan hal hal yang dilakukan ketika <strong>retrospective.<\/strong><\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li>Buat List apa hal yang <strong>bekerja dengan baik<\/strong> dan apa yang <strong>dapat ditingkatkan<\/strong><\/li>\r\n<li>Buat prioritas dari list yang ada.<\/li>\r\n<li>Diskusi untuk peningkatan untuk masing masing list tersebut<\/li>\r\n<li>Buat action plan.<\/li>\r\n<li>Laksanakan action plan pada sprint berikutnya<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:core-embed\/youtube {\"url\":\"https:\/\/youtu.be\/dJNCHvqKljU\",\"type\":\"video\",\"providerNameSlug\":\"youtube\",\"className\":\"wp-embed-aspect-16-9 wp-has-aspect-ratio\"} --><\/p>\r\n<figure class=\"wp-block-embed-youtube wp-block-embed is-type-video is-provider-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\">\r\n<div class=\"wp-block-embed__wrapper\"><iframe src=\"\/\/www.youtube.com\/embed\/er9gntPjTJU\" width=\"560\" height=\"314\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/div>\r\n<\/figure>\r\n<p><!-- \/wp:core-embed\/youtube --> <!-- wp:paragraph --><\/p>\r\n<p>Template Retrospective<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Retrospective dapat memiliki beberapa template untuk mengevaluasi cara kerja. List yang ada dapat dibuat bervariasi dengan beberapa template tertentu.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li>Whats behaviour to start \/ stop \/ continue : Menekankan pada kegiatan apa yang harus dikerjakan pada sprint berikutnya, hal apa yang harus di hentikan, dan apa yang harus tetap dilanjutkan.<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:image {\"id\":4575,\"sizeSlug\":\"large\"} --><\/p>\r\n<figure class=\"wp-block-image size-large\"><img class=\"wp-image-4575\" src=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/startstopcontinue.png\" alt=\"\" \/><\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li>More or less : Fokus kepada apa yang harus lebih banyak dilakkan dan apa yang harus dikurangi. Biasanya digabung juga dengan start stop continue.<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:image {\"id\":4576,\"sizeSlug\":\"large\"} --><\/p>\r\n<figure class=\"wp-block-image size-large\"><img class=\"wp-image-4576\" src=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/lessmore.png\" alt=\"\" \/><\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li>Glad \/ Sad \/ Mad : Fokus terhadap apa yang dirasakan oleh tim, apa yang disukai, membuat marah dan sedih.<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:image {\"id\":4578,\"sizeSlug\":\"large\"} --><\/p>\r\n<figure class=\"wp-block-image size-large\"><img class=\"wp-image-4578\" src=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/06\/madsadglad.png\" alt=\"\" \/><\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:paragraph --><\/p>\r\n<p>Dan masih banyak template lainnya. Sebagai referensi, kamu dapat mencoba beberapa template yang ada pada link berikut : <a href=\"https:\/\/www.teamretro.com\/retrospectives\/\">https:\/\/www.teamretro.com\/retrospectives\/<\/a><\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:file {\"id\":10153,\"href\":\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/Materi-day-8.pdf\"} --><\/p>\r\n<div class=\"wp-block-file\"><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/Materi-day-8.pdf\">Materi-day-8<\/a><a class=\"wp-block-file__button\" href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/Materi-day-8.pdf\" download=\"\">Unduh<\/a><\/div>\r\n<p><!-- \/wp:file --> <!-- wp:file {\"id\":10155,\"href\":\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/Soal-Tugas-Day-8-1.docx\"} --><\/p>\r\n<div class=\"wp-block-file\"><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/Soal-Tugas-Day-8-1.docx\">Soal-Tugas-Day-8-1<\/a><a class=\"wp-block-file__button\" href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/Soal-Tugas-Day-8-1.docx\" download=\"\">Unduh<\/a><\/div>\r\n<p><!-- \/wp:file --><\/p>","waktu_publish":"2021-11-03 08:00:00","status_publish":"publish","urutan":1,"created_by":8100,"updated_by":8100,"created_at":"2020-12-08 21:04:42","updated_at":"2021-10-24 11:23:47","waktu_publish_formatted":" Rabu, 03 November 2021. 08:00:00 WIB."}]},{"id":90,"uuid":"ab649ee1-ca46-4f61-b35b-351ebb664174","materi_id":6,"nama":"Day 9","permalink":"day-9","urutan":9,"created_by":8100,"updated_by":8100,"created_at":"2020-12-07 10:45:08","updated_at":"2021-04-25 10:41:39","posting":[{"id":301,"uuid":"68d2c455-eb14-4967-b939-4bd4ca2803e9","author_user_id":8100,"materi_section_id":90,"judul":"Day 9 : Scrum Implementation Using Management Tools","permalink":"day-9-scrum-implementation-using-management-tools","konten":"<p><!-- wp:paragraph --><\/p>\r\n<p>Halo teman-teman.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Selamat, pada tahap ini seharusnya teman-teman sudah mendapatkan semua teori tentang scrum, dan sudah punya cukup bekal untuk mencoba memulai menerapkan scrum dalam keseharian teman-teman. Nah tapi, dari kemarin kita selalu bicara tentang teori, mulai dari scrum team, values, principle, hingga proses. Abis belajar semua itu, bisa dapet apa sih sebenernya ? nah, dari materi yang teman-teman ambil, teman-teman sudah dapat mencoba untuk mengikuti sertifikasi fundamental scrum nih dengan mengikuti ujian yang disediakan oleh scrumstudy pada link ini :<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p><a href=\"https:\/\/www.scrumstudy.com\/certification\/scrum-fundamentals-certified\">https:\/\/www.scrumstudy.com\/certification\/scrum-fundamentals-certified<\/a><\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>(Spoiler : gratis)<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Nah, sekarang di pertemuan ini kita bakal coba untuk masuk lebih dari sekedar teori aja nih. hari ini kita akan coba untuk mengenalkan teman-teman kepada implementasi dari scrum menggunakan project management tools. harapannya, setelah hari ini, teman-teman sudah dapat mempraktekkan scrum dan gak lagi bingung gimana cara mulainya.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Pertama, sebelum memulai ada beberapa hal dulu nih yang kita harus pahami. Scrum pada dasarnya itu merupakan cara kerja dan gak terikat sama tools tertentu. disini, kita bakal lebih mencoba untuk implementasi dengan salah satu contoh aja, tapi bukan berarti hanya tools itu saja yang dapat diterapkan. nah buat memahami supaya kita bisa pake tools apapun untuk menerapkan scrum, disini kita akan coba bedah, sebenernya butuh tools apa aja sih kita ? Secara garis besar, kita butuh beberapa tools berikut<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li>Documentation Tools <br \/>Tools ini diperlukan untuk mendokumentasikan beberapa artifact yang diperlukan. contohnya seperti product vision, product requirement, Slides, dan lain lain. cara paling mudah dan kolaboratif untuk ini adalah dengan menggunakan<strong><em> Google Suite ( Gdocs, Gsheet, Slides, etc).<\/em><\/strong> Beberapa tools lain seperti Confluence, juga menawarkan solusi lain yang lebih terintegrasi (dengan JIRA). Untuk bentuk dokumentasi detil, sebenarnya tidak ditetapkan bagaimana caranya dalam scrum. Scrum hanya menentukan adanya artifact berupa product backlog, sprint backlog, dan increment saja. Namun, pada kebanyakan kasus, product backlog dan sprint backlog saja tidak cukup. terkadang perlu ditambahkan beberapa dokumen seperti requirement document, dan juga dokumen UAT atau technical documentation. hal ini tidak distandarkan dalam scrum, tapi akan baik apabila ada. Untuk dokumentasi, pastikan hal hal berikut.\r\n<ul>\r\n<li>Dokumen dapat diakses oleh seluruh anggota tim<\/li>\r\n<li>Dokumen memuat informasi detil yang tidak bisa dijelaskan dalam meeting<\/li>\r\n<li>Dokumen memuat user story yang akan dikembangkan<\/li>\r\n<\/ul>\r\n<\/li>\r\n<li>Project Management Tools <br \/>Project Management Tools, pada dasarnya merupakan tools yang biasa dilakukan untuk manajemen task. Pada manajemen proyek tradisional, salah satu contoh toolsnya adalah Microsoft Project. akan tetapi, dalam agile, terutama scrum terdapat beberapa tools yang sering digunakan, seperti <strong><em>Trello, JIRA, Clickup, monday.com, dll<\/em><\/strong><em>.<\/em> Pada materi ini akan coba untuk diberikan contoh salah satu penggunaan management tools yang mudah, yaitu Trello.<\/li>\r\n<li>Retrospective Tools <br \/>Retrospective Tools merupakan tools untuk melaksanakan retrospective. Retrospective dalam scrum pada dasarnya dapat dilaksanakan secara fisik dengan menggunakan sticky notes dan kemudian dibahas satu persatu, atau dapat juga secara online. Untuk pelaksanaan retrospective secara online, seringkali prosesnya cukup rumit untuk dilakukan hanya dengan menggunakan online conference tools seperti zoom atau gmeet, karena beberapa feedback mungkin ingin diberikan secara anonim. oleh karena itu, platform retrospective ini hadir untuk mempermudah proses tersebut. terdapat banyak platform yang bisa digunakan mulai dari parabol, teamretro, ataupun reetro.io.<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Nah di pertemuan ini, kita akan lebih membahas mengenai sisi management toolsnya dulu nih. jadi untuk project management tools ini terlepas dari apapun toolsnya, kita harus dapat melakukan aktivitas berikut.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li>Mampu memisahkan product backlog dan sprint backlog<\/li>\r\n<li>Mampu memberikan visualisasi prioritas pada backlog<\/li>\r\n<li>Mampu menghubungkan masing-masing user story dengan task<\/li>\r\n<li>Mampu memberikan pembobotan kepada masing-masing task<\/li>\r\n<li>Mampu memberikan status pada task yang dikerjakan<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>nah dengan spesifikasi tersebut, mari kita coba untuk implementasi dengan menggunakan <strong>trello.<\/strong> board untuk contoh dapat diakses pada link <strong>Template Board Trello<\/strong>. Adapun implementasi ini akan kita buat menjadi 3 tahap, yaitu sebagai berikut.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li>Membuat board yang dibutuhkan <br \/>Dalam membuat board, pastikan kamu memiliki board yang memuat :\r\n<ol>\r\n<li>Daftar Product Backlog<\/li>\r\n<li>Daftar Sprint Backlog<\/li>\r\n<li>Daftar Pekerjaan dengan status To Do<\/li>\r\n<li>Daftar Pekerjaan dengan status in Progress<\/li>\r\n<li>Daftar Pekerjaan dengan status Done (bisa ditambah review,etc)<\/li>\r\n<li>Daftar user story yang telah diselesaikan<\/li>\r\n<\/ol>\r\n<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>Board yang sudah dibuat kurang lebih akan berbentuk sebagai berikut.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:gallery {\"ids\":[10185]} --><\/p>\r\n<figure class=\"wp-block-gallery columns-1 is-cropped\">\r\n<ul class=\"blocks-gallery-grid\">\r\n<li class=\"blocks-gallery-item\">\r\n<figure><img class=\"wp-image-10185\" src=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/Screen-Shot-2020-09-03-at-00.14.41-2-1024x576.png\" alt=\"\" data-id=\"10185\" data-full-url=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/Screen-Shot-2020-09-03-at-00.14.41-2.png\" data-link=\"https:\/\/blog.sanbercode.com\/docs\/agile-development-using-scrum-agustus\/hari-9-scrum-implementation-using-tools\/screen-shot-2020-09-03-at-00-14-41-2\/\" \/>\r\n<figcaption class=\"blocks-gallery-item__caption\">Board Scrum Awal<\/figcaption>\r\n<\/figure>\r\n<\/li>\r\n<\/ul>\r\n<\/figure>\r\n<p><!-- \/wp:gallery --> <!-- wp:list --><\/p>\r\n<ul>\r\n<li>Mendefinisikan user story &amp; task <br \/>Setelah memiliki list list pada board scrum kita, kita dapat melakukan pembuatan user story. sebagai contoh,saya akan memasukkan beberapa user story berikut.<\/li>\r\n<\/ul>\r\n<p><!-- \/wp:list --> <!-- wp:image {\"id\":10190,\"sizeSlug\":\"large\"} --><\/p>\r\n<figure class=\"wp-block-image size-large\"><img class=\"wp-image-10190\" src=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/Screen-Shot-2020-09-03-at-00.42.20-1024x509.png\" alt=\"\" \/>\r\n<figcaption>Pembuatan User Story dan task<\/figcaption>\r\n<\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:paragraph --><\/p>\r\n<p>Pada contoh ini, dilakukan juga pembobotan task dengan menggunakan power ups. kamu dapat melakukan step berikut.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:list {\"ordered\":true} --><\/p>\r\n<ol>\r\n<li>Klik power ups<\/li>\r\n<li>Cari \"scrum\"<\/li>\r\n<li>Pilih Agile tools by Corello<\/li>\r\n<li>Setup sesuai dengan metode pembobotan story poin kamu<\/li>\r\n<\/ol>\r\n<p><!-- \/wp:list --> <!-- wp:paragraph --><\/p>\r\n<p>ketika sudah selesai, kamu dapat memberikan pembobotan seperti berikut.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:image {\"id\":10189,\"width\":307,\"height\":255,\"sizeSlug\":\"large\"} --><\/p>\r\n<figure class=\"wp-block-image size-large is-resized\"><img class=\"wp-image-10189\" src=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/Screen-Shot-2020-09-03-at-00.38.44.png\" alt=\"\" width=\"307\" height=\"255\" \/><\/figure>\r\n<p><!-- \/wp:image --> <!-- wp:paragraph --><\/p>\r\n<p>Nah, setelah itu, kamu bisa menjalankan sprint dan memindahkan user story sesuai kebutuhan kamu. Pada akhir sprint review, user story yang sudah diterima oleh Product Owner, dapat dimasukkan kedalam user story finished, dan task nya dapat di arsipkan melalui trello atau dibuatkan list tersendiri.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\r\n<p>Mudah kan ? sekarang kamu dapat coba untuk membuat board kamu sendiri, baik dengan menggunakan scrum atau menggunakan tools lainnya.<\/p>\r\n<p><!-- \/wp:paragraph --> <!-- wp:file {\"id\":10191,\"href\":\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/Materi-Day-9.pdf\"} --><\/p>\r\n<div class=\"wp-block-file\"><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/Materi-Day-9.pdf\">Materi-Day-9<\/a><a class=\"wp-block-file__button\" href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/Materi-Day-9.pdf\" download=\"\">Unduh<\/a><\/div>\r\n<p><!-- \/wp:file --> <!-- wp:file {\"id\":10192,\"href\":\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/Soal-Tugas-Day-9.docx\"} --><\/p>\r\n<div class=\"wp-block-file\"><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/Soal-Tugas-Day-9.docx\">Soal-Tugas-Day-9<\/a><a class=\"wp-block-file__button\" href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/Soal-Tugas-Day-9.docx\" download=\"\">Unduh<\/a><\/div>\r\n<p><!-- \/wp:file --> <!-- wp:file {\"id\":10194,\"href\":\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/CloverStudyCase.pdf\"} --><\/p>\r\n<div class=\"wp-block-file\"><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/CloverStudyCase.pdf\">Studi-Kasus<\/a><a class=\"wp-block-file__button\" href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/CloverStudyCase.pdf\" download=\"\">Unduh<\/a><\/div>\r\n<p><!-- \/wp:file --><\/p>","waktu_publish":"2021-11-04 08:00:00","status_publish":"publish","urutan":1,"created_by":8100,"updated_by":8100,"created_at":"2020-12-08 21:06:05","updated_at":"2021-10-24 11:23:56","waktu_publish_formatted":" Kamis, 04 November 2021. 08:00:00 WIB."}]},{"id":91,"uuid":"98b84ca7-189a-4cd5-8df8-d055336009ed","materi_id":6,"nama":"Day 10","permalink":"day-10","urutan":10,"created_by":8100,"updated_by":8100,"created_at":"2020-12-07 10:45:14","updated_at":"2021-04-25 10:41:39","posting":[{"id":380,"uuid":"15c6f400-fc5e-41b0-9290-7201cdc1b8b6","author_user_id":8100,"materi_section_id":91,"judul":"Introduction to Product Development","permalink":"introduction-to-product-development","konten":"<p>Halo semuanya !&nbsp;<\/p>\r\n<p>untuk materi hari ini, langsung dalam bentuk slides dan bisa diakses disini ya :&nbsp;<br \/><br \/><\/p>\r\n<p><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/12\/Materi-10-Introduction-to-Product-Development.pptx\">Materi Day 10&nbsp;<\/a><\/p>\r\n<p><a href=\"https:\/\/blog.sanbercode.com\/wp-content\/uploads\/2020\/09\/Soal-Tugas-Day-10.docx\">Tugas Day 10&nbsp;<\/a><\/p>","waktu_publish":"2021-11-05 08:00:00","status_publish":"publish","urutan":1,"created_by":8100,"updated_by":8100,"created_at":"2020-12-18 08:02:18","updated_at":"2021-10-24 11:24:13","waktu_publish_formatted":" Jumat, 05 November 2021. 08:00:00 WIB."}]}],"list_kelas":null,"is_done":0}